[{
  "_id": {
    "$oid": "6762511c9df1004d490c848c"
  },
  "title": "1,000 Places to See Before You Die",
  "price": 26.08,
  "availability": 1,
  "description": "Around the World, continent by continent, here is the best the world has to offer: 1,000 places guaranteed to give travelers the shivers. Sacred ruins, grand hotels, wildlife preserves, hilltop villages, snack shacks, castles, festivals, reefs, restaurants, cathedrals, hidden islands, opera houses, museums, and more. Each entry tells exactly why it's essential to visit. Th Around the World, continent by continent, here is the best the world has to offer: 1,000 places guaranteed to give travelers the shivers. Sacred ruins, grand hotels, wildlife preserves, hilltop villages, snack shacks, castles, festivals, reefs, restaurants, cathedrals, hidden islands, opera houses, museums, and more. Each entry tells exactly why it's essential to visit. Then come the nuts and bolts: addresses, websites, phone and fax numbers, best times to visit. Stop dreaming and get going.This hefty volume reminds vacationers that hot tourist spots are small percentage of what's worth seeing out there. A quick sampling: Venice's Cipriani Hotel; California's Monterey Peninsula; the Lewis and Clark Trail in Oregon; the Great Wall of China; Robert Louis Stevenson's home in Western Samoa; and the Alhambra in Andalusia, Spain. Veteran travel guide writer Schultz divides the book geographically, presenting a little less than a page on each location. Each entry lists exactly where to find the spot (e.g. Moorea is located \"12 miles/19 km northwest of Tahiti; 10 minutes by air, 1 hour by boat\") and when to go (e.g., if you want to check out The Complete Fly Fisher hotel in Montana, \"May and Sept.-Oct. offer productive angling in a solitary setting\"). This is an excellent resource for the intrepid traveler.Copyright 2003 Reed Business Information, Inc. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c84a8"
  },
  "title": "The No. 1 Ladies' Detective Agency (No. 1 Ladies' Detective Agency #1)",
  "price": 57.7,
  "availability": 1,
  "description": "The No.1 ladies' detective agency consists of one woman, the engaging and sassy Precious Ramotswe, who sets up shop in Gabarone, Botswana. This unlikely herione specialises in missing husbands, wayward daughters, con men and impostors."
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c84a9"
  },
  "title": "The Girl You Lost",
  "price": 12.29,
  "availability": 1,
  "description": "Eighteen years ago your baby daughter was snatched. Today, she came back. A sinister and darkly compelling psychological thriller from the No.1 bestselling author of The Girl With No Past. Eighteen years ago, Simone Porter’s six-month-old daughter, Helena, was abducted. Simone and husband, Matt, have slowly rebuilt their shattered lives, but the pain at losing their child Eighteen years ago your baby daughter was snatched. Today, she came back. A sinister and darkly compelling psychological thriller from the No.1 bestselling author of The Girl With No Past. Eighteen years ago, Simone Porter’s six-month-old daughter, Helena, was abducted. Simone and husband, Matt, have slowly rebuilt their shattered lives, but the pain at losing their child has never left them. Then a young woman, Grace, appears out of the blue and tells Simone she has information about her stolen baby. But just who is Grace – and can Simone trust her? When Grace herself disappears, Simone becomes embroiled in a desperate search for her daughter and the woman who has vital clues about her whereabouts. Simone is inching closer to the truth but it’ll take her into dangerous and disturbing territory. Simone lost her baby. Will she lose her life trying to find her? Read what people are saying about the Number One Bestseller, The Girl With No Past: ‘I read this in a day and found myself totally engaged with the plot. Kathryn Croft has pulled off a very accessible mystery, that exceeded my expectations and shows her talent. The ending was just right! Worth a read if you fancy a well paced mystery, on these dark autumnal nights.’ Northern Crime ‘Kept the tension and mystery going right until the end … An intense read that keeps you turning page after page.’ Crime Book Club ‘Wow! This book grabbed me from the very beginning! … To say this book is a page turner would be an understatement!’ Chat About Books ‘It kept me up all night and cost me my beauty sleep! I will get it out of the way immediately and tell you that this is one of the best thrillers I have read this year and it is fully deserving of my 5-star rating.’ Books Are Man’s Other Best Friend ‘BLIMEY. This book is GRIPPY - I sat and read it over the course of a day and a night, purely because I couldn't put it down.’ Reading Room with a View ‘The reader is kept guessing until the end. It's perfection for a thriller and the author does amazingly to keep our intrigue.’ Chic Toronto ‘Gripping, a real page turner… Excellent plot, and gripping stuff, that keeps the reader guessing until the end … raced to the end to find out what was happening and how it would all end … what a storyteller Kathryn Croft is!’ Emma’s Book Reviews ‘The concept of this book, and the story itself is phenomenal - honestly one of the best i have read, it really does outshine all other thrillers i have read.’ Afternoon Bookery ‘I really enjoyed this from start to finish. It's one of these books where you just HAVE to read JUST a couple more pages to see what is going to happen next. The author is very good at building suspense and revealing details bit by bit. It was totally unpredictable and had some very good twists. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c84aa"
  },
  "title": "The Girl In The Ice (DCI Erika Foster #1)",
  "price": 15.85,
  "availability": 1,
  "description": "Her eyes are wide open. Her lips parted as if to speak. Her dead body frozen in the ice…She is not the only one. When a young boy discovers the body of a woman beneath a thick sheet of ice in a South London park, Detective Erika Foster is called in to lead the murder investigation. The victim, a beautiful young socialite, appeared to have the perfect life. Yet when Erika b Her eyes are wide open. Her lips parted as if to speak. Her dead body frozen in the ice…She is not the only one. When a young boy discovers the body of a woman beneath a thick sheet of ice in a South London park, Detective Erika Foster is called in to lead the murder investigation. The victim, a beautiful young socialite, appeared to have the perfect life. Yet when Erika begins to dig deeper, she starts to connect the dots between the murder and the killings of three prostitutes, all found strangled, hands bound and dumped in water around London. What dark secrets is the girl in the ice hiding? As Erika inches closer to uncovering the truth, the killer is closing in on Erika. The last investigation Erika led went badly wrong… resulting in the death of her husband. With her career hanging by a thread, Erika must now battle her own personal demons as well as a killer more deadly than any she’s faced before. But will she get to him before he strikes again?A page-turning thriller packed with suspense. If you like Angela Marsons, Rachel Abbott and Karin Slaughter, discover Rob Bryndza’s new series today – at a special launch price. Watch out for more from DCI Erika FosterShe’s fearless. Respected. Unstoppable. Detective Erika Foster will catch a killer, whatever it takes. 1. THE GIRL IN THE ICE 2. THE NIGHT STALKER (COMING SOON) ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c84ab"
  },
  "title": "Blood Defense (Samantha Brinkman #1)",
  "price": 20.3,
  "availability": 1,
  "description": "First in a new series from bestselling author and famed O. J. Simpson trial prosecutor Marcia Clark, a “terrific writer and storyteller” (James Patterson). Samantha Brinkman, an ambitious, hard-charging Los Angeles criminal defense attorney, is struggling to make a name for herself and to drag her fledgling practice into the big leagues. Sam lands a high-profile double-mu First in a new series from bestselling author and famed O. J. Simpson trial prosecutor Marcia Clark, a “terrific writer and storyteller” (James Patterson). Samantha Brinkman, an ambitious, hard-charging Los Angeles criminal defense attorney, is struggling to make a name for herself and to drag her fledgling practice into the big leagues. Sam lands a high-profile double-murder case in which one of the victims is a beloved TV star—and the defendant is a decorated veteran LAPD detective. It promises to be exactly the kind of media sensation that would establish her as a heavy hitter in the world of criminal law.Though Sam has doubts about his innocence, she and her two associates (her closest childhood friend and a brilliant ex-con) take the case. Notorious for living by her own rules—and fearlessly breaking everyone else’s—Samantha pulls out all the stops in her quest to uncover evidence that will clear the detective. But when a shocking secret at the core of the case shatters her personal world, Sam realizes that not only has her client been playing her, he might be one of the most dangerous sociopaths she’s ever encountered. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c84ac"
  },
  "title": "1st to Die (Women's Murder Club #1)",
  "price": 53.98,
  "availability": 1,
  "description": "James Patterson, bestselling author of the Alex Cross novels Along Came a Spider, Kiss the Girls, and Pop Goes the Weasel, offers the first of a new series dubbed The Women's Murder Club, featuring a four-woman team that occasionally works outside the system. None of the gritty darkness or frenzied action is lost in 1st to Die, although the female protagonists offer an eve James Patterson, bestselling author of the Alex Cross novels Along Came a Spider, Kiss the Girls, and Pop Goes the Weasel, offers the first of a new series dubbed The Women's Murder Club, featuring a four-woman team that occasionally works outside the system. None of the gritty darkness or frenzied action is lost in 1st to Die, although the female protagonists offer an even deeper emotional context to this suspense thriller.Inspector Lindsay Boxer of the San Francisco Police Department suddenly finds herself in the middle of two horrifying situations: The first is that she's just learned she has an often-fatal blood disease. The second is a double homicide case she is now heading up that involves the murder of newlyweds on their wedding night. Burdened with Chris Raleigh, a new partner reassigned from the mayor's office, Lindsay finds that she has too much to deal with and turns to her best friend, Claire, the head ME on the case. Claire offers helpful advice and human, friendly contact amid a job filled with violence, cruelty, and fear.Soon a fledgling newspaper reporter, Cindy, makes contact with Lindsay looking for a career-making story. Although Lindsay can't officially comment on the case, the two women form a rapport, and Cindy joins Lindsay and Claire for their weekly meeting. When a second pair of newlyweds is murdered, and later a third, the investigation leads to a prominent crime writer, Nicholas Jenks, who has a history of spousal abuse and a predilection for kinky, dangerous sex games. With the help of an understanding assistant D.A., Jill Bernhardt, Lindsay tries to make a case against Jenks, who even had an affair with one of the slain women. Eventually Jill joins the Murder Club, and the four ladies share private interdepartmental information in an effort to track and stop the killer before he strikes again.The major subplot -- Lindsay's facing up to her illness even while she learns to fall in love again -- carefully compensates for the novel's coarse scenes of brutality. Lindsay Boxer is't merely an obsessed cop trailing a maniac; she's also a terrified woman confronting the onslaught of disease. The story lines balance out to show us the true mettle of someone who puts the safety of others before her own.Again, Patterson's skill for producing furiously paced fiction are evident as the novel breezes by rapidly. The short chapters keep the narrative leaping with increasingly taut plot elements, but there's an emotional commitment that makes our protagonist even more amiable and involving. 1st to Die is a novel that works as an intense series of character portraits that will leave the reader touched and delighted.--Tom Piccirilli ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c84c2"
  },
  "title": "While You Were Mine",
  "price": 41.32,
  "availability": 1,
  "description": "Everything she loved could so easily be lost.The end of World War II should have brought joy to Gwen Mullen. But on V-J Day, her worst fear is realized. As celebrating crowds gather in Times Square, a soldier appears on her doorstep to claim Mary, the baby abandoned to Gwen one year earlier. Suddenly Gwen is on the verge of losing the child she has nurtured and loves dearl Everything she loved could so easily be lost.The end of World War II should have brought joy to Gwen Mullen. But on V-J Day, her worst fear is realized. As celebrating crowds gather in Times Square, a soldier appears on her doorstep to claim Mary, the baby abandoned to Gwen one year earlier. Suddenly Gwen is on the verge of losing the child she has nurtured and loves dearly.With no legal claim to Mary, Gwen begins to teach Lieutenant John McKee how to care for his child, knowing that he will ultimately take Mary away. What starts as a contentious relationship, however, turns into something more, and Gwen must open her heart to learn that love means taking chances.While You Were Mine paints a vivid portrait of 1940s New York and tells an enchanting tale of the nature of love and trust. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c84c3"
  },
  "title": "The Secret Healer",
  "price": 34.56,
  "availability": 1,
  "description": "In the fourteenth century, opportunities for women are limited to the home. But spirited young Madlen finds her calling as assistant to the city’s trusted midwife, Clara. Working alongside Clara, Madlen develops a surprisingly soothing technique and quickly becomes a talented healer.After Clara’s tragic death, Madlen alone rushes to assist the birth of a local nobleman’s c In the fourteenth century, opportunities for women are limited to the home. But spirited young Madlen finds her calling as assistant to the city’s trusted midwife, Clara. Working alongside Clara, Madlen develops a surprisingly soothing technique and quickly becomes a talented healer.After Clara’s tragic death, Madlen alone rushes to assist the birth of a local nobleman’s child. But rather than the joy of birth, Madlen walks into an accusation of murder and witchcraft because of her extraordinary gifts. Forced to flee her own town, she establishes a new identity in the home of her aunt. Yet even though it endangers her life, she cannot resist the urge to help the sick patients who seek out her miraculous treatment. When she meets handsome Johannes—an investigator hired by the Church to bring her to justice for sacrilegious acts—she becomes drawn to the very man who could destroy her.Will Madlen’s gifts bring about her downfall? Or can love and reason prevail in a time of fearful superstition? ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c84c4"
  },
  "title": "Starlark",
  "price": 25.83,
  "availability": 1,
  "description": "On the morning of her wedding, Roma awakens to find that a 21st century eclipse has swept her through time and space to medieval Ireland—a land bedevilled with strife, conflict and danger at every possible turn. Soon caught up in an intricate spider’s web of political intrigue, Roma is forced to ally herself and marry a man she passionately hates—a cocky, rugged, silver-to On the morning of her wedding, Roma awakens to find that a 21st century eclipse has swept her through time and space to medieval Ireland—a land bedevilled with strife, conflict and danger at every possible turn. Soon caught up in an intricate spider’s web of political intrigue, Roma is forced to ally herself and marry a man she passionately hates—a cocky, rugged, silver-tongued Irish warrior—and the only man who can protect her from the dark forces at work on the Emerald Isle… For under the rolling green hills of the ancient Irish countryside lies a powerful force that even today is only spoken of in hushed tones. And as the war deepens, Roma finds herself falling for the one man she swore that she never would—her husband, Fionn, whose fierce passion drives her crazy despite herself. Roma’s a very long way from home—but her battle has only just begun, and now she needs Fionn’s help more than ever to succeed…and craves his touch more than ever to survive. Rich in historical detail and breathtaking romance, prepare to be swept back in time to the lush mythology, epic legends, and Celtic magic of STARLARK’s medieval Ireland—and the spellbinding tale of a love so absolute it transcends time itself… ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c84c5"
  },
  "title": "Lost Among the Living",
  "price": 27.7,
  "availability": 1,
  "description": "England, 1921. Three years after her husband, Alex, disappeared, shot down over Germany, Jo Manders still mourns his loss. Working as a paid companion to Alex's wealthy, condescending aunt, Dottie Forsyth, Jo travels to the family’s estate in the Sussex countryside. But there is much she never knew about her husband’s origins…and the revelation of a mysterious death in the England, 1921. Three years after her husband, Alex, disappeared, shot down over Germany, Jo Manders still mourns his loss. Working as a paid companion to Alex's wealthy, condescending aunt, Dottie Forsyth, Jo travels to the family’s estate in the Sussex countryside. But there is much she never knew about her husband’s origins…and the revelation of a mysterious death in the Forsyths’ past is just the beginning…All is not well at Wych Elm House. Dottie's husband is distant, and her son was grievously injured in the war. Footsteps follow Jo down empty halls, and items in her bedroom are eerily rearranged. The locals say the family is cursed, and that a ghost in the woods has never rested. And when Jo discovers her husband’s darkest secrets, she wonders if she ever really knew him. Isolated in a place of deception and grief, she must find the truth or lose herself forever.And then a familiar stranger arrives at Wych Elm House… ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c84c6"
  },
  "title": "A Spy's Devotion (The Regency Spies of London #1)",
  "price": 16.97,
  "availability": 1,
  "description": "In England’s Regency era, manners and elegance reign in public life—but behind closed doors treason and tawdriness thrive. Nicholas Langdon is no stranger to reserved civility or bloody barbarity. After suffering a battlefield injury, the wealthy, well-connected British officer returns home to heal—and to fulfill a dying soldier’s last wish by delivering his coded diary.At In England’s Regency era, manners and elegance reign in public life—but behind closed doors treason and tawdriness thrive. Nicholas Langdon is no stranger to reserved civility or bloody barbarity. After suffering a battlefield injury, the wealthy, well-connected British officer returns home to heal—and to fulfill a dying soldier’s last wish by delivering his coded diary.At the home of the Wilherns, one of England’s most powerful families, Langdon attends a lavish ball where he meets their beautiful and intelligent ward, Julia Grey. Determined to maintain propriety, he keeps his distance—until the diary is stolen and all clues lead to Julia’s guardian. As Langdon traces an evil plot that could be the nation’s undoing, he grows ever more intrigued by the lovely young woman. And when Julia realizes that England—and the man she is falling in love with—need her help, she finds herself caught in the fray. Will the two succumb to their attraction while fighting to save their country? ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8503"
  },
  "title": "Y: The Last Man, Vol. 1: Unmanned (Y: The Last Man #1)",
  "price": 18.51,
  "availability": 1,
  "description": "\"Y\" is none other than unemployed escape artist Yorick Brown (his father was a Shakespeare buff), and he's seemingly the only male human left alive after a mysterious plague kills all Y-chromosome carriers on earth. But why are he and his faithful companion, the often testy male monkey Ampersand, still alive? He sets out to find the answer (and his girlfriend), while runni \"Y\" is none other than unemployed escape artist Yorick Brown (his father was a Shakespeare buff), and he's seemingly the only male human left alive after a mysterious plague kills all Y-chromosome carriers on earth. But why are he and his faithful companion, the often testy male monkey Ampersand, still alive? He sets out to find the answer (and his girlfriend), while running from angry female Republicans (now running the government), Amazon wannabes that include his own sister (seemingly brainwashed), and other threats. The Vertigo team of Brian K. Vaughan, Pia Guerra, and José Marzán Jr. have given us a great read!Collects Y: The Last Man issues #01-#05 ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8504"
  },
  "title": "The Wicked + The Divine, Vol. 1: The Faust Act (The Wicked + The Divine)",
  "price": 36.52,
  "availability": 1,
  "description": "Every ninety years, twelve gods incarnate as humans. They are loved. They are hated. In two years, they are dead. The team behind critical tongue-attractors like Young Avengers and PHONOGRAM reunite to create a world where gods are the ultimate pop stars and pop stars are the ultimate gods. But remember: just because you’re immortal, doesn’t mean you’re going to live forev Every ninety years, twelve gods incarnate as humans. They are loved. They are hated. In two years, they are dead. The team behind critical tongue-attractors like Young Avengers and PHONOGRAM reunite to create a world where gods are the ultimate pop stars and pop stars are the ultimate gods. But remember: just because you’re immortal, doesn’t mean you’re going to live forever. Collects THE WICKED + THE DIVINE #1-5 ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8505"
  },
  "title": "The Sandman, Vol. 1: Preludes and Nocturnes (The Sandman (volumes) #1)",
  "price": 54.12,
  "availability": 1,
  "description": "In 1916, Dream is captured and encased in a glass globe in a failed attempt by a fictional Edwardian magician (very much in the vein of Aleister Crowley) named Roderick Burgess to bind Death and attain immortality. Dream bides his time for decades until Burgess dies. Afterwards, his son Alexander becomes Dream's new captor. Finally, in 1988, Alex's guards grow careless and In 1916, Dream is captured and encased in a glass globe in a failed attempt by a fictional Edwardian magician (very much in the vein of Aleister Crowley) named Roderick Burgess to bind Death and attain immortality. Dream bides his time for decades until Burgess dies. Afterwards, his son Alexander becomes Dream's new captor. Finally, in 1988, Alex's guards grow careless and the guards watching him fall asleep in his presence, allowing Dream to use the sand from their dream to his benefit. When the guards awake and break the seal Dream was in, he is then able to escape. Dream punishes Alex by cursing him to experience an unending series of nightmares. The rest of the story concerns Dream's quest to recover his totems of power, which were dispersed following his capture: a pouch of sand, a helm and a ruby. The pouch is being kept by a former girlfriend of John Constantine's. Once that is recovered, Dream travels to hell to regain the helm from a demon, where he incurs the wrath of Lucifer (an enmity that will have major repercussions later in the series). The ruby is in the possession of John Dee, a.k.a. Doctor Destiny, a supervillain from the Justice League of America series. He has warped and corrupted the ruby, rendering Dream unable to use it, and with it he nearly tears apart the Dreaming. However, thinking that it will kill Dream, Dee shatters the ruby, inadvertently releasing the power that Dream had stored in the ruby and restoring Dream to his full power. The collection ends with \"The Sound of Her Wings\", an epilogue to the first story-arc. This issue introduces a character who has become one of the series' most popular and prominent personalities: Dream's older sister Death. She is depicted as an attractive, down-to-earth young goth girl, very unlike the traditional personification of death, and spends the issue talking Dream out of his brief post-quest depression. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8506"
  },
  "title": "The Complete Maus (Maus #1-2)",
  "price": 10.64,
  "availability": 1,
  "description": "Combined for the first time here are Maus I: A Survivor's Tale and Maus II - the complete story of Vladek Spiegelman and his wife, living and surviving in Hitler's Europe. By addressing the horror of the Holocaust through cartoons, the author captures the everyday reality of fear and is able to explore the guilt, relief and extraordinary sensation of survival - and how the Combined for the first time here are Maus I: A Survivor's Tale and Maus II - the complete story of Vladek Spiegelman and his wife, living and surviving in Hitler's Europe. By addressing the horror of the Holocaust through cartoons, the author captures the everyday reality of fear and is able to explore the guilt, relief and extraordinary sensation of survival - and how the children of survivors are in their own way affected by the trials of their parents. A contemporary classic of immeasurable significance. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8507"
  },
  "title": "Skip Beat!, Vol. 01 (Skip Beat! #1)",
  "price": 42.12,
  "availability": 1,
  "description": "Kyoko always thought that Sho, whose family took her in when she was small, was her prince charming. However, when Sho heads for Tokyo to make it big as a musician, Kyoko goes with him and has to quit high school to support his dream. But soon, being in the big city makes Kyoko realize that she has show business ambitions of her own!"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8508"
  },
  "title": "Saga, Volume 1 (Saga (Collected Editions) #1)",
  "price": 28.48,
  "availability": 1,
  "description": "When two soldiers from opposite sides of a never-ending galactic war fall in love, they risk everything to bring a fragile new life into a dangerous old universe. From bestselling writer Brian K. Vaughan, Saga is the sweeping tale of one young family fighting to find their place in the worlds. Fantasy and science fiction are wed like never before in this sexy, subversive d When two soldiers from opposite sides of a never-ending galactic war fall in love, they risk everything to bring a fragile new life into a dangerous old universe. From bestselling writer Brian K. Vaughan, Saga is the sweeping tale of one young family fighting to find their place in the worlds. Fantasy and science fiction are wed like never before in this sexy, subversive drama for adults. Collects Saga issues #1-6. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8509"
  },
  "title": "Rat Queens, Vol. 1: Sass & Sorcery (Rat Queens (Collected Editions) #1-5)",
  "price": 46.96,
  "availability": 1,
  "description": "Who are the Rat Queens? A pack of booze-guzzling, death-dealing battle maidens-for-hire, and they're in the business of killing all god's creatures for profit. It's also a darkly comedic sass-and-sorcery series starring Hannah the Rockabilly Elven Mage, Violet the Hipster Dwarven Fighter, Dee the Atheist Human Cleric and Betty the Hippy Smidgen Thief. This modern spin on a Who are the Rat Queens? A pack of booze-guzzling, death-dealing battle maidens-for-hire, and they're in the business of killing all god's creatures for profit. It's also a darkly comedic sass-and-sorcery series starring Hannah the Rockabilly Elven Mage, Violet the Hipster Dwarven Fighter, Dee the Atheist Human Cleric and Betty the Hippy Smidgen Thief. This modern spin on an old school genre is a violent monster-killing epic that is like Buffy meets Tank Girl in a Lord of the Rings world on crack! Collecting Rat Queens #1-5! ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c850a"
  },
  "title": "Paper Girls, Vol. 1 (Paper Girls #1-5)",
  "price": 21.71,
  "availability": 1,
  "description": "In the early hours after Halloween of 1988, four 12-year-old newspaper delivery girls uncover the most important story of all time. Suburban drama and otherworldly mysteries collide in this smash-hit series about nostalgia, first jobs, and the last days of childhood.Collects Paper Girls #1-5."
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c850b"
  },
  "title": "Ouran High School Host Club, Vol. 1 (Ouran High School Host Club #1)",
  "price": 29.87,
  "availability": 1,
  "description": "One day, Haruhi, a scholarship student at exclusive Ouran High School, breaks an $80,000 vase that belongs to the 'Host Club', a mysterious campus group consisting of six super-rich (and gorgeous) guys. To pay back the damages, she is forced to work for the club, and it's there that she discovers just how wealthy the boys are and how different they are from everybody else."
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c850c"
  },
  "title": "Ms. Marvel, Vol. 1: No Normal (Ms. Marvel (2014-2015) #1)",
  "price": 39.39,
  "availability": 1,
  "description": "Marvel Comics presents the new Ms. Marvel, the groundbreaking heroine that has become an international sensation! Kamala Khan is an ordinary girl from Jersey City — until she's suddenly empowered with extraordinary gifts. But who truly is the new Ms. Marvel? Teenager? Muslim? Inhuman? Find out as she takes the Marvel Universe by storm! When Kamala discovers the dangers of Marvel Comics presents the new Ms. Marvel, the groundbreaking heroine that has become an international sensation! Kamala Khan is an ordinary girl from Jersey City — until she's suddenly empowered with extraordinary gifts. But who truly is the new Ms. Marvel? Teenager? Muslim? Inhuman? Find out as she takes the Marvel Universe by storm! When Kamala discovers the dangers of her newfound powers, she unlocks a secret behind them, as well. Is Kamala ready to wield these immense new gifts? Or will the weight of the legacy before her be too much to bear? Kamala has no idea, either. But she's comin' for you, Jersey! It's history in the making from acclaimed writer G. Willow Wilson (Air, Cairo) and beloved artist Adrian Alphona (RUNAWAYS)! Collecting MS. MARVEL (2014) #1-5 and material from ALL-NEW MARVEL NOW! POINT ONE #1. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c850d"
  },
  "title": "Hawkeye, Vol. 1: My Life as a Weapon (Hawkeye #1)",
  "price": 45.24,
  "availability": 1,
  "description": "The breakout star of this summer's blockbuster Avengers film, Clint Barton - aka the self-made hero Hawkeye - fights for justice! With ex-Young Avenger Kate Bishop by his side, he's out to prove himself as one of Earth's Mightiest Heroes! SHIELD recruits Clint to intercept a packet of incriminating evidence - before he becomes the most wanted man in the world. You won't be The breakout star of this summer's blockbuster Avengers film, Clint Barton - aka the self-made hero Hawkeye - fights for justice! With ex-Young Avenger Kate Bishop by his side, he's out to prove himself as one of Earth's Mightiest Heroes! SHIELD recruits Clint to intercept a packet of incriminating evidence - before he becomes the most wanted man in the world. You won't believe what is on The Tape! What is the Vagabond Code? Matt Fraction pens a Hawkeye thriller that spans the globe...and the darkest parts of Hawkeye's mind. Barton and Bishop mean double the Hawkeye and double the trouble...and stealing from the rich never looked so good.COLLECTING: Hawkeye 1-5, Young Avengers Presents 6 ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c850e"
  },
  "title": "Giant Days, Vol. 1 (Giant Days #1-4)",
  "price": 56.76,
  "availability": 1,
  "description": "Susan, Esther, and Daisy started at university three weeks ago and became fast friends. Now, away from home for the first time, all three want to reinvent themselves. But in the face of handwringing boys, “personal experimentation,” influenza, mystery mold, nuchauvinism, and the willful, unwanted intrusion of “academia,” they may be lucky just to make it to spring alive. C Susan, Esther, and Daisy started at university three weeks ago and became fast friends. Now, away from home for the first time, all three want to reinvent themselves. But in the face of handwringing boys, “personal experimentation,” influenza, mystery mold, nuchauvinism, and the willful, unwanted intrusion of “academia,” they may be lucky just to make it to spring alive. Collects issues #1-4. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c850f"
  },
  "title": "Fruits Basket, Vol. 1 (Fruits Basket #1)",
  "price": 40.28,
  "availability": 1,
  "description": "A family with an ancient curse...And the girl who will change their lives forever...Tohru Honda was an orphan with no place to go until the mysterious Sohma family offered her a place to call home. Now her ordinary high school life is turned upside down as she's introduced to the Sohma's world of magical curses and family secrets."
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8510"
  },
  "title": "Bleach, Vol. 1: Strawberry and the Soul Reapers (Bleach #1)",
  "price": 34.65,
  "availability": 1,
  "description": "Hot-tempered 15-year-old Ichigo Kurosaki, the hero of the popular fantasy-adventure Bleach , has the unsettling ability to see spirits who are unable to rest in peace. His sixth sense leads him to Rukia, a Soul Reaper who destroys Hollows (soul-devouring monsters) and ensures the deceased find repose with the Soul Society. When she's injured in battle, Rukia transfers h Hot-tempered 15-year-old Ichigo Kurosaki, the hero of the popular fantasy-adventure Bleach , has the unsettling ability to see spirits who are unable to rest in peace. His sixth sense leads him to Rukia, a Soul Reaper who destroys Hollows (soul-devouring monsters) and ensures the deceased find repose with the Soul Society. When she's injured in battle, Rukia transfers her sword and much of her power to Ichigo, whose spiritual energy makes him a formidable substitute Soul Reaper. But the orange-haired teenager isn't sure he wants the job: too many risks and moral dilemmas. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8511"
  },
  "title": "Ajin: Demi-Human, Volume 1 (Ajin: Demi-Human #1)",
  "price": 57.06,
  "availability": 1,
  "description": "High school student Kei Nagai is struck dead in a grizzly traffic accident, but immediately revives to learn that he may not be like every other human. Instead, he may be a mysterious almost immortal being granted not only the powers of rejuvination but the abilities to see super-natural beings. Scared, he runs away, and is aided in his escape from society by his friend. U High school student Kei Nagai is struck dead in a grizzly traffic accident, but immediately revives to learn that he may not be like every other human. Instead, he may be a mysterious almost immortal being granted not only the powers of rejuvination but the abilities to see super-natural beings. Scared, he runs away, and is aided in his escape from society by his friend. Unfortunately for Kei, the manhunt is on and he will soon be caught within a conflict between mankind and others like him as they prepare to fight a new war based on terror. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c851f"
  },
  "title": "The Story of Hong Gildong",
  "price": 43.19,
  "availability": 1,
  "description": "The Story of Hong Gildong is arguably the single most important work of classic Korean fiction. Like its English counterpart, Robin Hood, it has been adapted into countless movies, television shows, novels and comics. Its memorable lines are known to virtually every Korean by heart. Until now, this incredible 19th century fable has been all but inaccessible to English read The Story of Hong Gildong is arguably the single most important work of classic Korean fiction. Like its English counterpart, Robin Hood, it has been adapted into countless movies, television shows, novels and comics. Its memorable lines are known to virtually every Korean by heart. Until now, this incredible 19th century fable has been all but inaccessible to English readers.Hong Gildong, the brilliant but illegitimate son of a government minister, cannot advance in society due to his secondary status, so he leaves home to become the leader of a band of outlaws who rob the rich to give to the poor. On the way to building his own empire and gaining acceptance from his family, Hong Gildong vanquishes assassins, battles monsters, and conquers kingdoms. Minsoo Kang's expressive and animated new translation finally makes the original text of this classic available in English, re-introducing a noble and righteous outlaw and sharing a beloved hallmark of Korean culture. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8520"
  },
  "title": "The Little Prince",
  "price": 45.42,
  "availability": 1,
  "description": "Moral allegory and spiritual autobiography, The Little Prince is the most translated book in the French language. With a timeless charm it tells the story of a little boy who leaves the safety of his own tiny planet to travel the universe, learning the vagaries of adult behaviour through a series of extraordinary encounters. His personal odyssey culminates in a voyage to E Moral allegory and spiritual autobiography, The Little Prince is the most translated book in the French language. With a timeless charm it tells the story of a little boy who leaves the safety of his own tiny planet to travel the universe, learning the vagaries of adult behaviour through a series of extraordinary encounters. His personal odyssey culminates in a voyage to Earth and further adventures. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8521"
  },
  "title": "Sense and Sensibility",
  "price": 37.46,
  "availability": 1,
  "description": "'The more I know of the world, the more am I convinced that I shall never see a man whom I can really love. I require so much!'Marianne Dashwood wears her heart on her sleeve, and when she falls in love with the dashing but unsuitable John Willoughby she ignores her sister Elinor's warning that her impulsive behaviour leaves her open to gossip and innuendo. Meanwhile Elino 'The more I know of the world, the more am I convinced that I shall never see a man whom I can really love. I require so much!'Marianne Dashwood wears her heart on her sleeve, and when she falls in love with the dashing but unsuitable John Willoughby she ignores her sister Elinor's warning that her impulsive behaviour leaves her open to gossip and innuendo. Meanwhile Elinor, always sensitive to social convention, is struggling to conceal her own romantic disappointment, even from those closest to her. Through their parallel experience of love—and its threatened loss—the sisters learn that sense must mix with sensibility if they are to find personal happiness in a society where status and money govern the rules of love.This edition includes explanatory notes, textual variants between the first and second editions, and Tony Tanner's introduction to the original Penguin Classic edition. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8522"
  },
  "title": "Of Mice and Men",
  "price": 47.11,
  "availability": 1,
  "description": "The compelling story of two outsiders striving to find their place in an unforgiving world. Drifters in search of work, George and his simple-minded friend Lennie have nothing in the world except each other and a dream--a dream that one day they will have some land of their own. Eventually they find work on a ranch in California’s Salinas Valley, but their hopes are doomed The compelling story of two outsiders striving to find their place in an unforgiving world. Drifters in search of work, George and his simple-minded friend Lennie have nothing in the world except each other and a dream--a dream that one day they will have some land of their own. Eventually they find work on a ranch in California’s Salinas Valley, but their hopes are doomed as Lennie, struggling against extreme cruelty, misunderstanding and feelings of jealousy, becomes a victim of his own strength. Tackling universal themes such as the friendship of a shared vision, and giving voice to America’s lonely and dispossessed, Of Mice and Men has proved one of Steinbeck’s most popular works, achieving success as a novel, a Broadway play and three acclaimed films. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8523"
  },
  "title": "Emma",
  "price": 32.93,
  "availability": 1,
  "description": "'I never have been in love; it is not my way, or my nature; and I do not think I ever shall.'Beautiful, clever, rich - and single - Emma Woodhouse is perfectly content with her life and sees no need for either love or marriage. Nothing, however, delights her more than interfering in the romantic lives of others. But when she ignores the warnings of her good friend Mr. Knig 'I never have been in love; it is not my way, or my nature; and I do not think I ever shall.'Beautiful, clever, rich - and single - Emma Woodhouse is perfectly content with her life and sees no need for either love or marriage. Nothing, however, delights her more than interfering in the romantic lives of others. But when she ignores the warnings of her good friend Mr. Knightley and attempts to arrange a suitable match for her protegee Harriet Smith, her carefully laid plans soon unravel and have consequences that she never expected. With its imperfect but charming heroine and its witty and subtle exploration of relationships, Emma is often seen as Jane Austen's most flawless work.This edition includes a new chronology and additional suggestions for further reading. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8524"
  },
  "title": "Alice in Wonderland (Alice's Adventures in Wonderland #1)",
  "price": 55.53,
  "availability": 1,
  "description": ""
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c852d"
  },
  "title": "The Nicomachean Ethics",
  "price": 36.34,
  "availability": 1,
  "description": "‘One swallow does not make a summer; neither does one day. Similarly neither can one day, or a brief space of time, make a man blessed and happy’In the Nicomachean Ethics, Aristotle sets out to examine the nature of happiness. He argues that happiness consists in ‘activity of the soul in accordance with virtue’, for example with moral virtues, such as courage, generosity a ‘One swallow does not make a summer; neither does one day. Similarly neither can one day, or a brief space of time, make a man blessed and happy’In the Nicomachean Ethics, Aristotle sets out to examine the nature of happiness. He argues that happiness consists in ‘activity of the soul in accordance with virtue’, for example with moral virtues, such as courage, generosity and justice, and intellectual virtues, such as knowledge, wisdom and insight. The Ethics also discusses the nature of practical reasoning, the value and the objects of pleasure, the different forms of friendship, and the relationship between individual virtue, society and the State. Aristotle’s work has had a profound and lasting influence on all subsequent Western thought about ethical matters.J. A. K. Thomson’s translation has been revised by Hugh Tredennick, and is accompanied by a new introduction by Jonathan Barnes. This edition also includes an updated list for further reading and a new chronology of Aristotle’s life and works.Previously published as Ethics ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c852e"
  },
  "title": "Meditations",
  "price": 25.89,
  "availability": 1,
  "description": "Written in Greek, without any intention of publication, by the only Roman emperor who was also a philosopher, the Meditations of Marcus Aurelius (AD 121-180) offer a remarkable series of challenging spiritual reflections and exercises developed as the emperor struggled to understand himself and make sense of the universe. Ranging from doubt and despair to conviction and ex Written in Greek, without any intention of publication, by the only Roman emperor who was also a philosopher, the Meditations of Marcus Aurelius (AD 121-180) offer a remarkable series of challenging spiritual reflections and exercises developed as the emperor struggled to understand himself and make sense of the universe. Ranging from doubt and despair to conviction and exaltation, they cover such diverse topics as the nature of moral virtue, human rationality, divine providence, and Marcus' own emotions. But while the Meditations were composed to provide personal consolation and encouragement, in developing his beliefs Marcus Aurelius also created one of the greatest of all works of philosophy: a timeless collection of extended meditations and short aphorisms that has been consulted and admired by statesmen, thinkers and readers through the centuries. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c852f"
  },
  "title": "Beyond Good and Evil",
  "price": 43.38,
  "availability": 1,
  "description": "Friedrich Nietzsche's Beyond Good and Evil is translated from the German by R.J. Hollingdale with an introduction by Michael Tanner in Penguin Classics.Beyond Good and Evil confirmed Nietzsche's position as the towering European philosopher of his age. The work dramatically rejects the tradition of Western thought with its notions of truth and God, good and evil. Nietzsche Friedrich Nietzsche's Beyond Good and Evil is translated from the German by R.J. Hollingdale with an introduction by Michael Tanner in Penguin Classics.Beyond Good and Evil confirmed Nietzsche's position as the towering European philosopher of his age. The work dramatically rejects the tradition of Western thought with its notions of truth and God, good and evil. Nietzsche demonstrates that the Christian world is steeped in a false piety and infected with a 'slave morality'. With wit and energy, he turns from this critique to a philosophy that celebrates the present and demands that the individual imposes their own 'will to power' upon the world.This edition includes a commentary on the text by the translator and Michael Tanner's introduction, which explains some of the more abstract passages in Beyond Good and Evil.Frederich Nietzsche (1844-1900) became the chair of classical philology at Basel University at the age of 24 until his bad health forced him to retire in 1879. He divorced himself from society until his final collapse in 1899 when he became insane. A powerfully original thinker, Nietzsche's influence on subsequent writers, such as George Bernard Shaw, D.H. Lawrence, Thomas Mann and Jean-Paul Sartre, was considerable.If you enjoyed Beyond Good and Evil you might like Nietzsche's Thus Spoke Zarathustra, also available in Penguin Classics.'One of the greatest books of a very great thinker'Michael Tanner ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8549"
  },
  "title": "Where Lightning Strikes (Bleeding Stars #3)",
  "price": 39.77,
  "availability": 1,
  "description": "Do you know what it feels like right before lightning strikes? How you can feel the current running through your veins? The trembles of warning that ripple through the air? It was a thrill Tamar King chased all her life until it became the very thing she had to escape. For the last four years, Tamar King has hidden herself in an isolated world she created. She was safe. No Do you know what it feels like right before lightning strikes? How you can feel the current running through your veins? The trembles of warning that ripple through the air? It was a thrill Tamar King chased all her life until it became the very thing she had to escape. For the last four years, Tamar King has hidden herself in an isolated world she created. She was safe. No one could touch her. Until Lyrik West walked through her door. He’s the lead guitarist for Sunder and everything she can never have. The dark and beautiful rock star becomes everything she craves. Lyrik’s life has been devoted to his band and that success has cost him. Bitter, hard, and filled with regret, he refuses to lose himself again, but from the moment he sees her, he wants one night with Tamar King. The gorgeous bartender is more than he bargained for. Their attraction is consuming. Their desire overpowering. With one touch, they ignite. But is it worth the cost of getting burned?She’s a gorgeous nightmare and he’s a wicked dream…WHERE LIGHTNING STRIKES, a Bleeding Stars Stand-Alone Novel ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c854a"
  },
  "title": "This One Moment (Pushing Limits #1)",
  "price": 48.71,
  "availability": 1,
  "description": "Fame, fortune, and stadiums full of screaming fans are right around the corner for the rock band at the heart of Stina Lindenblatt’s steamy, intense Pushing Limits series. But it’s an epic love affair that steals the show in this opening act.When Nolan Kincaid skipped town to chase the music career of his dreams, he knew he wouldn’t miss the reminders of his broken family— Fame, fortune, and stadiums full of screaming fans are right around the corner for the rock band at the heart of Stina Lindenblatt’s steamy, intense Pushing Limits series. But it’s an epic love affair that steals the show in this opening act.When Nolan Kincaid skipped town to chase the music career of his dreams, he knew he wouldn’t miss the reminders of his broken family—he wasn’t so sure he could forget the girl he left behind. Now his band is touring nonstop, the recording sessions go all night, and the groupies are crazed. But when he hears that Hailey Wilkins is in trouble, he drops everything.Hailey thought she’d missed her chance with Nolan. Five years ago, the moment she realized she loved him was the moment he decided to leave. Now, when a brutal assault lands her in the ICU, Nolan flies straight to her bedside, acting like nothing’s changed. What’s a rock star like him doing, canceling shows and risking his record deal, just to nurse an old friend back to health? And why should Hailey believe he’ll stay this time?With her attacker still at large, Nolan’s ready to rise to the occasion. He knows he let Hailey down once before, but he’s ready to give her everything, heart and soul—and he’ll fight for the chance to prove it. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c854b"
  },
  "title": "Rhythm, Chord & Malykhin",
  "price": 28.34,
  "availability": 1,
  "description": "Twenty-six-year-old Gaby Barreto might be a lot of things (loyal, sarcastic, one of the guys and a pain in the butt depending on which family member you ask), but dumb isn’t one of them. When her twin brother invites her to go on tour as his band’s merch girl, she isn’t exactly screaming at the top of her lungs with joy. With no job opportunities pounding on her door, an e Twenty-six-year-old Gaby Barreto might be a lot of things (loyal, sarcastic, one of the guys and a pain in the butt depending on which family member you ask), but dumb isn’t one of them. When her twin brother invites her to go on tour as his band’s merch girl, she isn’t exactly screaming at the top of her lungs with joy. With no job opportunities pounding on her door, an ex-boyfriend she would still like to castrate, and no end in sight to moving out of her parents’ house in Dallas… it would be dumb to say no to the chance of a lifetime. Two bands, three continents, one tour. Spending the next ninety-plus days with three beloved idiots and eight complete strangers shouldn’t be a big deal, right? If only the singer of the headlining band didn’t have tattoos... a great personality… a fantastic body… and if he wasn’t so funny…. Let’s be real: Gaby never had a chance against Sacha Malykhin. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c854c"
  },
  "title": "My Perfect Mistake (Over the Top #1)",
  "price": 38.92,
  "availability": 1,
  "description": "What happens in Aspenis definitely not staying in Aspen. . .A girls’ trip to Aspen was exactly what Shay needed to forget about her toxic ex-boyfriend. She’s got her girls, pristine slopes for skiing, and hot guys everywhere. Of course, her epic self-rediscovery goes completely to hell when a wild (and deliciously hot) skier knocks Shay on her ass . . . and war is declared What happens in Aspenis definitely not staying in Aspen. . .A girls’ trip to Aspen was exactly what Shay needed to forget about her toxic ex-boyfriend. She’s got her girls, pristine slopes for skiing, and hot guys everywhere. Of course, her epic self-rediscovery goes completely to hell when a wild (and deliciously hot) skier knocks Shay on her ass . . . and war is declared. Kolton doesn’t know what it is about Shay that makes him lose it. Not just his cool—although she does have an unholy gift for that—but his restraint. When anger gives way to explosive chemistry, they’re both shaken with the intensity of it. But somewhere between lust and hate, Kolton and Shay realize they could have something real . . . if they don’t kill each other first. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c854d"
  },
  "title": "Listen to Me (Fusion #1)",
  "price": 58.99,
  "availability": 1,
  "description": "In New York Times and USA Today bestselling author Kristen Proby’s brand new series, five best friends open a hot new restaurant, but one of them gets much more than she bargained for when a sexy former rock star walks through the doors—and into her heart.Seduction is quickly becoming the hottest new restaurant in Portland, and Addison Wade is proud to claim 1/5 of the cre In New York Times and USA Today bestselling author Kristen Proby’s brand new series, five best friends open a hot new restaurant, but one of them gets much more than she bargained for when a sexy former rock star walks through the doors—and into her heart.Seduction is quickly becoming the hottest new restaurant in Portland, and Addison Wade is proud to claim 1/5 of the credit. She’s determined to make it a success and can’t think of a better way to bring in new customers than live music. But when former rock star Jake Keller swaggers through the doors to apply for the weekend gig, she knows she’s in trouble. Addie instantly recognizes him—his posters were plastered all over her bedroom walls in high school—he’s all bad boy...exactly her type and exactly what she doesn’t need.Jake Keller walked away from the limelight five years ago and yearns to return to what’s always driven him: the music. If he gets to work for a smart-mouthed, funny-as-hell bombshell, all the better. But talking Addie into giving him the job is far easier than persuading her that he wants more than a romp in her bed. Just when she begins to drop her walls, Jake’s past finally catches up with him.Will Addie be torn apart once again or will Jake be able to convince her to drown out her doubts and listen to her heart? ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c854e"
  },
  "title": "Imperfect Harmony",
  "price": 34.74,
  "availability": 1,
  "description": "Imperfect harmony can still be beautiful…John Fletcher, a former musician, is stuck in limbo after losing his long-term partner two years ago. He’s shut himself off from everything that reminds him of what he’s lost. When his neighbour persuades him to join the local community choir, John rediscovers his love of music and finds a reason to start living again.Rhys Callingto Imperfect harmony can still be beautiful…John Fletcher, a former musician, is stuck in limbo after losing his long-term partner two years ago. He’s shut himself off from everything that reminds him of what he’s lost. When his neighbour persuades him to join the local community choir, John rediscovers his love of music and finds a reason to start living again.Rhys Callington, the talented and charismatic choir leader, captures John’s attention from the first moment they meet. He appears to be the polar opposite of John: young, vibrant, and full of life. But Rhys has darkness in his own past that is holding him back from following his dreams.Despite the nineteen-year age gap, the two men grow close and a fragile relationship blossoms. Ghosts of the past and insecurities about the future threaten their newfound happiness. If they’re going to harmonise in life and love as they do in their music, they’ll need to start following the same score. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c854f"
  },
  "title": "Fighting Fate (Fighting #6)",
  "price": 39.24,
  "availability": 1,
  "description": "***BONUS CONTENT: The first two chapters of JB Salsbury's stand alone novel SPLIT included!Axelle’s broken.I live to hold her together.Killian McCreery only has two dreams . . .Fight for the UFL.And Axelle.He’s watched her give her time and her body to men who don’t deserve to breathe her air. He’s waited, worked hard to become the kind of man she deserves, hoping one day, ***BONUS CONTENT: The first two chapters of JB Salsbury's stand alone novel SPLIT included!Axelle’s broken.I live to hold her together.Killian McCreery only has two dreams . . .Fight for the UFL.And Axelle.He’s watched her give her time and her body to men who don’t deserve to breathe her air. He’s waited, worked hard to become the kind of man she deserves, hoping one day, when the time is right, he’d get the opportunity to make her happy. After a painful anniversary, he finally gets his chance.But life has a way of sucker-punching its victims—striking when they least expect it in the most devastating ways.Killian loves me.But I screwed up. Big time.Axelle Daniels appears to be the typical college student—parties, hangovers, and men. No one knows that inside she’s a mess, and no amount of booze or meaningless relationships have managed to fill the cracks in her heart. But Killian knows. He’s been there since the night it all began and has never left her side.When she wakes up one morning to find the consequences of her actions have caught up to her, even Killian’s white-knighthood can’t save her now.Fate is put to the test when, for the first time in their five-year friendship, they no longer have each other to lean on. When he becomes a UFL superstar, she hardly recognizes the man he used to be. And she no longer needs him to hold her together.With the foundation of their friendship gone, they’ll discover that even a love that is meant to be needs to be fought for and destiny is a choice. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8550"
  },
  "title": "Deep Under (Walker Security #1)",
  "price": 47.09,
  "availability": 1,
  "description": "Alternate cover edition for 9781682302262Myla is beautiful, a dove with clipped wings, captive by the wolf, a vicious drug lord. One look into her eyes and Kyle could see the pain, the fear…the desperation. Or so it seems. He’s been fooled before by a woman and it cost him everything and everyone he loved. He won’t be fooled again.Tall, dark, and deadly, these are the stor Alternate cover edition for 9781682302262Myla is beautiful, a dove with clipped wings, captive by the wolf, a vicious drug lord. One look into her eyes and Kyle could see the pain, the fear…the desperation. Or so it seems. He’s been fooled before by a woman and it cost him everything and everyone he loved. He won’t be fooled again.Tall, dark, and deadly, these are the stories of the men who run Walker security. Each man is unique in his methods and skills, but all share key similarities. They are passionate about those they love, relentless when fighting for a cause they believe in, and all believe that no case is too hard, no danger too dark. Dedication is what they deliver, results are their reward. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8551"
  },
  "title": "Charity's Cross (Charles Towne Belles #4)",
  "price": 41.24,
  "availability": 1,
  "description": "From the Winner of 2015's Inspirational Readers Choice Award for The Ransom comes a new romantic adventure ! Suspected of killing her husband, Charity Westcott flees on the first ship out of Portsmouth, England heading for the colonies. Loathing all men after her abusive marriage, she hopes to reunite with her family in Charles Towne, but the ship’s destination is Nassau. From the Winner of 2015's Inspirational Readers Choice Award for The Ransom comes a new romantic adventure ! Suspected of killing her husband, Charity Westcott flees on the first ship out of Portsmouth, England heading for the colonies. Loathing all men after her abusive marriage, she hopes to reunite with her family in Charles Towne, but the ship’s destination is Nassau. When she spots her husband’s brother, who is intent on seeing her hang, boarding her ship, she jumps overboard. Elias Dutton, missionary and son of the famous pirate, Rowan Dutton, must get to Barbados as soon as possible. His sister is in danger, and his parents have charged him with her safety. He cannot let them down—again. But after rescuing a madcap woman from the bay, he now finds himself tricked into masquerading as her husband so they both can procure passage to Barbados. Pirates, storms, shipwreck and betrayal threaten to delay the couple in their journey even as sparks fly between them. With her brother-in-law in fast pursuit, the last thing Charity wants is help from a man, especially a religious one, but she has no choice. After Elias’ heart was broken by a sordid woman who nearly ruined his life, he seeks a godly woman pure as the virgin sands of the Caribbean. He believes he has found such a woman in Charity. Until he discovers she is a murderer and is now faced with two choices: letting her go or turning her in to the authorities. Amazon Categories >Pirate Romance >Inspirational Romance >Time Travel Romance >Historical Romance >Romantic Suspense >Christian Romance >Clean Pirate Romance ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8552"
  },
  "title": "Bounty (Colorado Mountain #7)",
  "price": 37.26,
  "availability": 1,
  "description": "Justice Lonesome has enjoyed a life of bounty. Even so, she’s inherited the curse of the Lonesome. A poet’s soul. Which means she’s still searching for something. Searching for peace. Searching for the less…that’s more. And when the foundation of her life is pulled out from under her, grieving, she goes to the mountains to find her oasis. She hits Carnal, Colorado and deci Justice Lonesome has enjoyed a life of bounty. Even so, she’s inherited the curse of the Lonesome. A poet’s soul. Which means she’s still searching for something. Searching for peace. Searching for the less…that’s more. And when the foundation of her life is pulled out from under her, grieving, she goes to the mountains to find her oasis. She hits Carnal, Colorado and decides to stay. Deke Hightower lost everything at the age of two. He lost it again at fifteen. His life has not been about bounty. It’s been about learning to live with less, because there’s no way to get more. Deke’s also watched all his friends go down to the women who gave them what they needed. He wants that for himself. But he knows that search isn’t going to be easy because he’s a rider. His home is the road. That’s the only place he can breathe. And the woman who takes her place at his side has to do it sitting on the back of his bike. When Deke meets Justice, he knows she’s not that woman. She’s cute. She’s sweet. And she’s into him, but she’s got it all and Deke knows he won’t fit into that. So he holds her at arm’s length. Establishes boundaries. And Justice will take it because she wants Deke any way he’ll let her have him.But when Justice finds herself a pawn in a dangerous game, Deke makes a decision. When he does, he has no idea he’s just opened himself up to bounty. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8562"
  },
  "title": "The Edge of Reason (Bridget Jones #2)",
  "price": 19.18,
  "availability": 1,
  "description": "Monday 27 January“7:15 a.m. Hurrah! The wilderness years are over. For four weeks and five days now have been in functional relationship with adult male, thereby proving am not love pariah as recently feared.”Lurching from the cappuccino bars of Notting Hill to the blissed-out shores of Thailand, Bridget Jones searches for The Truth in spite of pathetically unevolved men, Monday 27 January“7:15 a.m. Hurrah! The wilderness years are over. For four weeks and five days now have been in functional relationship with adult male, thereby proving am not love pariah as recently feared.”Lurching from the cappuccino bars of Notting Hill to the blissed-out shores of Thailand, Bridget Jones searches for The Truth in spite of pathetically unevolved men, insane dating theories, and Smug Married advice (\"I'm just calling to say in the potty! In the potty! Well, do it in Daddy's hand then!\"). She experiences a zeitgeist-esque Spiritual Epiphany somewhere between the pages of How to Find the Love You Want Without Seeking It (\"can self-help books really help self?\"), protective custody, and a lightly chilled Chardonnay.Wednesday 5 March“7:08 p.m. Am assured, receptive, responsive woman of substance. My sense of self comes not from other people but... from... myself? That can’t be right.”With another devastatingly hilarious, ridiculous, unnervingly accurate take on modern womanhood, Bridget Jones is back. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8563"
  },
  "title": "Bridget Jones's Diary (Bridget Jones #1)",
  "price": 29.82,
  "availability": 1,
  "description": "Meet Bridget Jones—a 30-something Singleton who is certain she would have all the answers if she could:a. lose 7 poundsb. stop smokingc. develop Inner Poise\"123 lbs. (how is it possible to put on 4 pounds in the middle of the night? Could flesh have somehow solidified becoming denser and heavier? Repulsive, horrifying notion), alcohol units 4 (excellent), cigarettes 21 (po Meet Bridget Jones—a 30-something Singleton who is certain she would have all the answers if she could:a. lose 7 poundsb. stop smokingc. develop Inner Poise\"123 lbs. (how is it possible to put on 4 pounds in the middle of the night? Could flesh have somehow solidified becoming denser and heavier? Repulsive, horrifying notion), alcohol units 4 (excellent), cigarettes 21 (poor but will give up totally tomorrow), number of correct lottery numbers 2 (better, but nevertheless useless)...\"Bridget Jones' Diary is the devastatingly self-aware, laugh-out-loud daily chronicle of Bridget's permanent, doomed quest for self-improvement — a year in which she resolves to: reduce the circumference of each thigh by 1.5 inches, visit the gym three times a week not just to buy a sandwich, form a functional relationship with a responsible adult, and learn to program the VCR.Over the course of the year, Bridget loses a total of 72 pounds but gains a total of 74. She remains, however, optimistic. Through it all, Bridget will have you helpless with laughter, and — like millions of readers the world round — you'll find yourself shouting, \"Bridget Jones is me!\" ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c85a0"
  },
  "title": "When I'm Gone",
  "price": 51.96,
  "availability": 1,
  "description": "Dear Luke,First let me say—I love you…I didn’t want to leave you… Luke Richardson has returned home after burying Natalie, his beloved wife of sixteen years, ready to face the hard job of raising their three children alone. But there’s something he’s not prepared for—a blue envelope with his name scrawled across the front in Natalie’s handwriting, waiting for him on the f Dear Luke,First let me say—I love you…I didn’t want to leave you… Luke Richardson has returned home after burying Natalie, his beloved wife of sixteen years, ready to face the hard job of raising their three children alone. But there’s something he’s not prepared for—a blue envelope with his name scrawled across the front in Natalie’s handwriting, waiting for him on the floor of their suburban Michigan home.The letter inside, written on the first day of Natalie’s cancer treatment a year ago, turns out to be the first of many. Luke is convinced they’re genuine, but who is delivering them? As his obsession with the letters grows, Luke uncovers long-buried secrets that make him question everything he knew about his wife and their family. But the revelations also point the way toward a future where love goes on—in written words, in memories, and in the promises it’s never too late to keep. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c85a1"
  },
  "title": "The Silent Wife",
  "price": 12.34,
  "availability": 1,
  "description": "A chilling psychological thriller about a marriage, a way of life, and how far one woman will go to keep what is rightfully hersJodi and Todd are at a bad place in their marriage. Much is at stake, including the affluent life they lead in their beautiful waterfront condo in Chicago, as she, the killer, and he, the victim, rush haplessly toward the main event. He is a commi A chilling psychological thriller about a marriage, a way of life, and how far one woman will go to keep what is rightfully hersJodi and Todd are at a bad place in their marriage. Much is at stake, including the affluent life they lead in their beautiful waterfront condo in Chicago, as she, the killer, and he, the victim, rush haplessly toward the main event. He is a committed cheater. She lives and breathes denial. He exists in dual worlds. She likes to settle scores. He decides to play for keeps. She has nothing left to lose. Told in alternating voices, The Silent Wife is about a marriage in the throes of dissolution, a couple headed for catastrophe, concessions that can’t be made, and promises that won’t be kept. Expertly plotted and reminiscent of Gone Girl and These Things Hidden, The Silent Wife ensnares the reader from page one and does not let go. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c85a2"
  },
  "title": "The Bette Davis Club",
  "price": 30.66,
  "availability": 1,
  "description": "The morning of her niece’s wedding, Margo Just drinks a double martini and contemplates the many mistakes she’s made in her fifty-odd years of life. Spending three decades in love with a wonderful but unattainable man is pretty high up on her list of missteps, as is a long line of unsuccessful love affairs accompanied by a seemingly endless supply of delicious cocktails.Wh The morning of her niece’s wedding, Margo Just drinks a double martini and contemplates the many mistakes she’s made in her fifty-odd years of life. Spending three decades in love with a wonderful but unattainable man is pretty high up on her list of missteps, as is a long line of unsuccessful love affairs accompanied by a seemingly endless supply of delicious cocktails.When the young bride flees—taking with her a family heirloom and leaving behind six hundred bewildered guests—her mother offers Margo fifty grand to retrieve her spoiled brat of a daughter and the invaluable property she stole. So, together with the bride’s jilted and justifiably crabby fiancé, Margo sets out in a borrowed 1955 red MG on a cross-country chase. Along the way, none of what she discovers will be quite what she expected. But it might be exactly what she’s been seeking all along.From acclaimed humor writer Jane Lotter comes this madcap, laugh-out-loud adventure, The Bette Davis Club. Revised edition: This edition of The Bette Davis Club includes editorial revisions. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c85a3"
  },
  "title": "Kitchens of the Great Midwest",
  "price": 57.2,
  "availability": 1,
  "description": "“A sweet and savory treat.” —People“An impressive feat of narrative jujitsu . . . that keeps readers turning the pages too fast to realize just how ingenious they are.”—The New York Times Book Review, Editor’s Pick“Kitchens of the Great Midwest is a terrific reminder of what can be wrested from suffering and struggle—not only success, but also considerable irony, a fair am “A sweet and savory treat.” —People“An impressive feat of narrative jujitsu . . . that keeps readers turning the pages too fast to realize just how ingenious they are.”—The New York Times Book Review, Editor’s Pick“Kitchens of the Great Midwest is a terrific reminder of what can be wrested from suffering and struggle—not only success, but also considerable irony, a fair amount of wisdom and a decent meal.”—Jane Smiley, The GuardianAs seen on The Skimm: “Warning: this will make you hungry. . . . You won’t be able to put it down. And it will up your kitchen game.”Kitchens of the Great Midwest, about a young woman with a once-in-a-generation palate who becomes the iconic chef behind the country’s most coveted dinner reservation, is the summer’s most hotly anticipated debut.   When Lars Thorvald’s wife, Cynthia, falls in love with wine—and a dashing sommelier—he’s left to raise their baby, Eva, on his own. He’s determined to pass on his love of food to his daughter—starting with puréed pork shoulder. As Eva grows, she finds her solace and salvation in the flavors of her native Minnesota. From Scandinavian lutefisk to hydroponic chocolate habaneros, each ingredient represents one part of Eva’s journey as she becomes the star chef behind a legendary and secretive pop-up supper club, culminating in an opulent and emotional feast that’s a testament to her spirit and resilience.   Each chapter in J. Ryan Stradal’s startlingly original debut tells the story of a single dish and character, at once capturing the zeitgeist of the Midwest, the rise of foodie culture, and delving into the ways food creates community and a sense of identity. By turns quirky, hilarious, and vividly sensory, Kitchens of the Great Midwest is an unexpected mother-daughter story about the bittersweet nature of life—its missed opportunities and its joyful surprises. It marks the entry of a brilliant new talent.From the Hardcover edition. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c85a4"
  },
  "title": "Bright Lines",
  "price": 39.07,
  "availability": 1,
  "description": "A vibrant debut novel, set in Brooklyn and Bangladesh, Bright Lines follows three young women and one family struggling to make peace with secrets and their past. For as long as she can remember, Ella has longed to feel at home. Orphaned as a child after her parents’ murder, and afflicted with hallucinations at dusk, she’s always felt more at ease in nature than with peopl A vibrant debut novel, set in Brooklyn and Bangladesh, Bright Lines follows three young women and one family struggling to make peace with secrets and their past. For as long as she can remember, Ella has longed to feel at home. Orphaned as a child after her parents’ murder, and afflicted with hallucinations at dusk, she’s always felt more at ease in nature than with people. She traveled from Bangladesh to Brooklyn to live with the Saleems: her uncle Anwar, aunt Hashi, and their beautiful daughter, Charu, her complete opposite. One summer, when Ella returns home from college, she discovers Charu’s friend Maya—an Islamic cleric’s runaway daughter—asleep in her bedroom.  As the girls have a summer of clandestine adventure and sexual awakenings, Anwar—owner of a popular botanical apothecary—has his own secrets, threatening his thirty-year marriage. But when tragedy strikes, the Saleems find themselves blamed. To keep his family from unraveling, Anwar takes them on a fated trip to Bangladesh, to reckon with the past, their extended family, and each other. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c85c0"
  },
  "title": "Matilda",
  "price": 28.34,
  "availability": 1,
  "description": "Matilda is a little girl who is far too good to be true. At age five-and-a-half she's knocking off double-digit multiplication problems and blitz-reading Dickens. Even more remarkably, her classmates love her even though she's a super-nerd and the teacher's pet. But everything is not perfect in Matilda's world. For starters she has two of the most idiotic, self-centered pa Matilda is a little girl who is far too good to be true. At age five-and-a-half she's knocking off double-digit multiplication problems and blitz-reading Dickens. Even more remarkably, her classmates love her even though she's a super-nerd and the teacher's pet. But everything is not perfect in Matilda's world. For starters she has two of the most idiotic, self-centered parents who ever lived. Then there's the large, busty nightmare of a school principal, Mrs. (\"The\") Trunchbull, a former hammer-throwing champion who flings children at will and is approximately as sympathetic as a bulldozer. Fortunately for Matilda, she has the inner resources to deal with such annoyances: astonishing intelligence, saintly patience, and an innate predilection for revenge.She warms up with some practical jokes aimed at her hapless parents, but the true test comes when she rallies in defense of her teacher, the sweet Miss Honey, against the diabolical Trunchbull. There is never any doubt that Matilda will carry the day. Even so, this wonderful story is far from predictable. Roald Dahl, while keeping the plot moving imaginatively, also has an unerring ear for emotional truth. The reader cares about Matilda because in addition to all her other gifts, she has real feelings. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c85c1"
  },
  "title": "Charlie and the Chocolate Factory (Charlie Bucket #1)",
  "price": 22.85,
  "availability": 1,
  "description": "Complete with stunning new movie art for the cover, and an eight-page full-color insert of stills from director Tim Burton's new adaptation, Dahl's treasured novel appears unabridged in this tie-in edition."
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c85c7"
  },
  "title": "The Bhagavad Gita",
  "price": 57.49,
  "availability": 1,
  "description": "The Bhagavad Gita is an intensely spiritual work that forms the cornerstone of the Hindu faith, and is also one of the masterpieces of Sanskrit poetry. It describes how, at the beginning of a mighty battle between the Pandava and Kaurava armies, the god Krishna gives spiritual enlightenment to the warrior Arjuna, who realizes that the true battle is for his own soul.Juan M The Bhagavad Gita is an intensely spiritual work that forms the cornerstone of the Hindu faith, and is also one of the masterpieces of Sanskrit poetry. It describes how, at the beginning of a mighty battle between the Pandava and Kaurava armies, the god Krishna gives spiritual enlightenment to the warrior Arjuna, who realizes that the true battle is for his own soul.Juan Mascaró's translation of The Bhagavad Gita captures the extraordinary aural qualities of the original Sanskrit. This edition features a new introduction by Simon Brodbeck, which discusses concepts such as dehin, prakriti and karma. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c85c8"
  },
  "title": "Choosing Our Religion: The Spiritual Lives of America's Nones",
  "price": 28.42,
  "availability": 1,
  "description": "To the dismay of religious leaders, study after study has shown a steady decline in affiliation and identification with traditional religions in America. By 2014, more than twenty percent of adults identified as unaffiliated--up more than seven percent just since 2007. Even more startling, more than thirty percent of those under the age of thirty now identify as \"Nones\"--a To the dismay of religious leaders, study after study has shown a steady decline in affiliation and identification with traditional religions in America. By 2014, more than twenty percent of adults identified as unaffiliated--up more than seven percent just since 2007. Even more startling, more than thirty percent of those under the age of thirty now identify as \"Nones\"--answering \"none\" when queried about their religious affiliation. Is America losing its religion? Or, as more and more Americans choose different spiritual paths, are they changing what it means to be religious in the United States today? In Choosing Our Religion, Elizabeth Drescher explores the diverse, complex spiritual lives of Nones across generations and across categories of self-identification as \"Spiritual-But-Not-Religious,\" \"Atheist,\" \"Agnostic,\" \"Humanist,\" \"just Spiritual,\" and more. Drawing on more than one hundred interviews conducted across the United States, Drescher opens a window into the lives of a broad cross-section of Nones, diverse with respect to age, gender, race, sexual orientation, and prior religious background. She allows Nones to speak eloquently for themselves, illuminating the processes by which they became None, the sources of information and inspiration that enrich their spiritual lives, the practices they find spiritually meaningful, how prayer functions in spiritual lives not centered on doctrinal belief, how morals and values are shaped outside of institutional religions, and how Nones approach the spiritual development of their own children. These compelling stories are deeply revealing about how religion is changing in America--both for Nones and for the religiously affiliated family, friends, and neighbors with whom their lives remain intertwined. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8633"
  },
  "title": "Travels with Charley: In Search of America",
  "price": 57.82,
  "availability": 1,
  "description": "An intimate journey across and in search of America, as told by one of its most beloved writers, in a deluxe centennial edition In September 1960, John Steinbeck embarked on a journey across America. He felt that he might have lost touch with the country, with its speech, the smell of its grass and trees, its color and quality of light, the pulse of its people. To reassure An intimate journey across and in search of America, as told by one of its most beloved writers, in a deluxe centennial edition In September 1960, John Steinbeck embarked on a journey across America. He felt that he might have lost touch with the country, with its speech, the smell of its grass and trees, its color and quality of light, the pulse of its people. To reassure himself, he set out on a voyage of rediscovery of the American identity, accompanied by a distinguished French poodle named Charley; and riding in a three-quarter-ton pickup truck named Rocinante.   His course took him through almost forty states: northward from Long Island to Maine; through the Midwest to Chicago; onward by way of Minnesota, North Dakota, Montana (with which he fell in love), and Idaho to Seattle, south to San Francisco and his birthplace, Salinas; eastward through the Mojave, New Mexico, Arizona, to the vast hospitality of Texas, to New Orleans and a shocking drama of desegregation; finally, on the last leg, through Alabama, Virginia, Pennsylvania, and New Jersey to New York.  Travels with Charley in Search of America is an intimate look at one of America's most beloved writers in the later years of his life—a self-portrait of a man who never wrote an explicit autobiography. Written during a time of upheaval and racial tension in the South—which Steinbeck witnessed firsthand—Travels with Charley is a stunning evocation of America on the eve of a tumultuous decade.  ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8634"
  },
  "title": "The Tumor",
  "price": 41.56,
  "availability": 1,
  "description": "John Grisham says THE TUMOR is the most important book he has ever written. In this short book, he provides readers with a fictional account of how a real, new medical technology could revolutionize the future of medicine by curing with sound. THE TUMOR follows the present day experience of the fictional patient Paul, an otherwise healthy 35-year-old father who is diagnose John Grisham says THE TUMOR is the most important book he has ever written. In this short book, he provides readers with a fictional account of how a real, new medical technology could revolutionize the future of medicine by curing with sound. THE TUMOR follows the present day experience of the fictional patient Paul, an otherwise healthy 35-year-old father who is diagnosed with a malignant brain tumor. Grisham takes readers through a detailed account of Paul’s treatment and his family’s experience that doesn’t end as we would hope. Grisham then explores an alternate future, where Paul is diagnosed with the same brain tumor at the same age, but in the year 2025, when a treatment called focused ultrasound is able to extend his life expectancy. Focused ultrasound has the potential to treat not just brain tumors, but many other disorders, including Parkinson’s, Alzheimer’s, hypertension, and prostate, breast and pancreatic cancer. For more information, you can visit The Focused Ultrasound Foundation’s website. Here you will find a video of Grisham on the TEDx stage with the Foundation’s chairman and a Parkinson’s patient who brings the audience to its feet sharing her incredible story of a focused ultrasound “miracle.” Readers will get a taste of the narrative they expect from Grisham, but this short book will also educate and inspire people to be hopeful about the future of medical innovation. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8635"
  },
  "title": "The End of the Jesus Era (An Investigation #1)",
  "price": 14.4,
  "availability": 1,
  "description": "God exists!? This may seem unprovable. The truth about Jesus differs radically from his traditional image!? This may seem absurd. However, both of the above assumptions are in fact provable through the logic that orders the Universe and also by virtue of the moral principles inherent in Life.This book initiates an independent investigation into the Jesus phenomenon. In par God exists!? This may seem unprovable. The truth about Jesus differs radically from his traditional image!? This may seem absurd. However, both of the above assumptions are in fact provable through the logic that orders the Universe and also by virtue of the moral principles inherent in Life.This book initiates an independent investigation into the Jesus phenomenon. In parallel with this, it opens up an exploration of the nature of the Creator. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8636"
  },
  "title": "Eat, Pray, Love",
  "price": 51.32,
  "availability": 1,
  "description": "In her early thirties, Elizabeth Gilbert had everything a modern American woman was supposed to want--husband, country home, successful career--but instead of feeling happy and fulfilled, she felt consumed by panic and confusion. This wise and rapturous book is the story of how she left behind all these outward marks of success, and of what she found in their place. Follow In her early thirties, Elizabeth Gilbert had everything a modern American woman was supposed to want--husband, country home, successful career--but instead of feeling happy and fulfilled, she felt consumed by panic and confusion. This wise and rapturous book is the story of how she left behind all these outward marks of success, and of what she found in their place. Following a divorce and a crushing depression, Gilbert set out to examine three different aspects of her nature, set against the backdrop of three different cultures: pleasure in Italy, devotion in India, and on the Indonesian island of Bali, a balance between worldly enjoyment and divine transcendence. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8642"
  },
  "title": "Old Records Never Die: One Man's Quest for His Vinyl and His Past",
  "price": 55.66,
  "availability": 1,
  "description": "Foreword by Wilco's Jeff Tweedy\"Memories are far more indelible when married to the physical world, and Spitznagel proves the point in this vivid book. We love vinyl records because they combine the tactile, the visual, the seeable effects of age and care and carelessless. When he searches for the records he lost and sold,Spitznagel istrying to return to a tangible past, a Foreword by Wilco's Jeff Tweedy\"Memories are far more indelible when married to the physical world, and Spitznagel proves the point in this vivid book. We love vinyl records because they combine the tactile, the visual, the seeable effects of age and care and carelessless. When he searches for the records he lost and sold, Spitznagel is trying to return to a tangible past, and he details that process with great sensitivity and impact.\"—Dave Eggers, author of The CircleHigh Fidelity meets Killing Yourself to Live in this memoir of one man's search for his lost record collection. As he finds himself within spitting distance of middle-age, journalist Eric Spitznagel feels acutely the loss of…something. Freedom? Maybe. Coolness? Could be. The records he sold in a financial pinch? Definitely. To find out for sure, he sets out on a quest to find  the original vinyl artifacts from his past. Not just copies. The exact same records: The Bon Jovi record with his first girlfriend's phone number scrawled on the front sleeve. The KISS Alive II he once shared with his little brother. The Replacements Let It Be he’s pretty sure, 20 years later, would still smell like weed. As he embarks on his hero's journey, he reminisces about the actual records, the music, and the people he listened to it with—old girlfriends, his high school pals, and, most poignantly, his father and his young son. He explores the magic of music and memory as he interweaves his adventures in record- culture with questions about our connection to our past, whether we can ever recapture it, and whether we would want to if we could. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8643"
  },
  "title": "Forever Rockers (The Rocker #12)",
  "price": 28.8,
  "availability": 1,
  "description": "My Happily Ever After was turning into a living nightmare... All I wanted was Harper's happiness and I would move the world to give her anything she ever wanted. We've searched for answers, talked about our options, and finally-FINALLY-found hope. Yet, just when things seemed to be perfect, it all came crashing down around us all. The one person I've always counted on to h My Happily Ever After was turning into a living nightmare... All I wanted was Harper's happiness and I would move the world to give her anything she ever wanted. We've searched for answers, talked about our options, and finally-FINALLY-found hope. Yet, just when things seemed to be perfect, it all came crashing down around us all. The one person I've always counted on to hold us together-to hold me together-was lost in her own nightmares and I felt like I was losing everything. Everything. I wasn't going to lose the woman I loved. I would hold onto her until the last breath left my body. It was my mistakes that were hurting us and I would be the one to fix it. I wouldn't let my past ruin my forever with Harper. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86d4"
  },
  "title": "The Zombie Room",
  "price": 19.69,
  "availability": 1,
  "description": "An unlikely bond is forged between three men from very different backgrounds when they serve time together in prison. A series of wrong turns and disastrous life choices has led to their incarceration. Following their release, Mangle, Decker and Tazeem stick together as they return to a life of crime, embarking on a lucrative scam. But when they stumble upon a sophisticate An unlikely bond is forged between three men from very different backgrounds when they serve time together in prison. A series of wrong turns and disastrous life choices has led to their incarceration. Following their release, Mangle, Decker and Tazeem stick together as they return to a life of crime, embarking on a lucrative scam. But when they stumble upon a sophisticated sex-trafficking operation, they soon realise that they are in mortal danger. The disappearance of a family member and the murder of a dear friend lead the three to delve deeper into a world of violence and deception. In their quest for retribution and justice, they put their lives on the line. Their paths cross with that of Tatiana, who has left her home country for a better life in the West - or so she thinks. She soon realises she is in the hands of ruthless, violent people, who run an operation supplying girls to meet the most deviant desires of rich and powerful men. Will she survive the horrors of The Zombie Room? Are Mangle, Decker and Tazeem brave enough to follow her there, in an attempt to set her free? ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86d5"
  },
  "title": "The Name of the Wind (The Kingkiller Chronicle #1)",
  "price": 50.59,
  "availability": 1,
  "description": "Told in Kvothe's own voice, this is the tale of the magically gifted young man who grows to be the most notorious wizard his world has ever seen. The intimate narrative of his childhood in a troupe of traveling players, his years spent as a near-feral orphan in a crime-ridden city, his daringly brazen yet successful bid to enter a legendary school of magic, and his life as Told in Kvothe's own voice, this is the tale of the magically gifted young man who grows to be the most notorious wizard his world has ever seen. The intimate narrative of his childhood in a troupe of traveling players, his years spent as a near-feral orphan in a crime-ridden city, his daringly brazen yet successful bid to enter a legendary school of magic, and his life as a fugitive after the murder of a king form a gripping coming-of-age story unrivaled in recent literature. A high-action story written with a poet's hand, The Name of the Wind is a masterpiece that will transport readers into the body and mind of a wizard. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86d6"
  },
  "title": "Taking Shots (Assassins #1)",
  "price": 18.88,
  "availability": 1,
  "description": "Elli Fisher has never thought she was good enough, let it be her job, her weight, her love life, nothing. That is until she meets Shea Adler. After doing a promotional shoot for the NHL team, the Assassins, she meets the hunky hockey player who shoots a puck, shattering her world.Shea Adler was tired of the life he was living outside of the rink. The girls, the money blowi Elli Fisher has never thought she was good enough, let it be her job, her weight, her love life, nothing. That is until she meets Shea Adler. After doing a promotional shoot for the NHL team, the Assassins, she meets the hunky hockey player who shoots a puck, shattering her world.Shea Adler was tired of the life he was living outside of the rink. The girls, the money blowing, the drinking, everything had to stop and it all did when he met Eleanor Fisher. He had never met anyone like her. She was feisty, witty, shy, and simply gorgeous. When he laid eyes on her, it was as if he was taking the hardest hit of his life into the boards, and he had to have her. Elli is a little skeptical of Shea, but he knows that they were meant to be together, and he needed her in his life. Can Elli throw her insecurities out the window and love Shea with everything inside of her, or will she let a past relationship, and her family ruin any chance of her being happy. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86d7"
  },
  "title": "Shatter Me (Shatter Me #1)",
  "price": 42.4,
  "availability": 1,
  "description": "I have a curseI have a giftI am a monsterI'm more than humanMy touch is lethalMy touch is powerI am their weaponI will fight backJuliette hasn’t touched anyone in exactly 264 days.The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really car I have a curseI have a giftI am a monsterI'm more than humanMy touch is lethalMy touch is powerI am their weaponI will fight backJuliette hasn’t touched anyone in exactly 264 days.The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really cares. The world is too busy crumbling to pieces to pay attention to a 17-year-old girl. Diseases are destroying the population, food is hard to find, birds don’t fly anymore, and the clouds are the wrong color.The Reestablishment said their way was the only way to fix things, so they threw Juliette in a cell. Now so many people are dead that the survivors are whispering war – and The Reestablishment has changed its mind. Maybe Juliette is more than a tortured soul stuffed into a poisonous body. Maybe she’s exactly what they need right now.Juliette has to make a choice: Be a weapon. Or be a warrior. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86d8"
  },
  "title": "Paradise Lost (Paradise #1)",
  "price": 24.96,
  "availability": 1,
  "description": "‘Better to reign in Hell, than serve in Heav’n …’In Paradise Lost, Milton produced a poem of epic scale, conjuring up a vast, awe-inspiring cosmos and ranging across huge tracts of space and time. And yet, in putting a charismatic Satan and naked Adam and Eve at the centre of this story, he also created an intensely human tragedy on the Fall of Man. Written when Milton was ‘Better to reign in Hell, than serve in Heav’n …’In Paradise Lost, Milton produced a poem of epic scale, conjuring up a vast, awe-inspiring cosmos and ranging across huge tracts of space and time. And yet, in putting a charismatic Satan and naked Adam and Eve at the centre of this story, he also created an intensely human tragedy on the Fall of Man. Written when Milton was in his fifties – blind, bitterly disappointed by the Restoration and briefly in danger of execution – Paradise Lost’s apparent ambivalence towards authority has led to intense debate about whether it manages to ‘justify the ways of God to men’, or exposes the cruelty of Christianity.John Leonard’s revised edition of Paradise Lost contains full notes, elucidating Milton’s biblical, classical and historical allusions and discussing his vivid, highly original use of language and blank verse. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86d9"
  },
  "title": "On the Road (Duluoz Legend)",
  "price": 32.36,
  "availability": 1,
  "description": "On the Road chronicles Jack Kerouac's years traveling the North American continent with his friend Neal Cassady, \"a sideburned hero of the snowy West.\" As \"Sal Paradise\" and \"Dean Moriarty,\" the two roam the country in a quest for self-knowledge and experience. Kerouac's love of America, his compassion for humanity, and his sense of language as jazz combine to make On the On the Road chronicles Jack Kerouac's years traveling the North American continent with his friend Neal Cassady, \"a sideburned hero of the snowy West.\" As \"Sal Paradise\" and \"Dean Moriarty,\" the two roam the country in a quest for self-knowledge and experience. Kerouac's love of America, his compassion for humanity, and his sense of language as jazz combine to make On the Road an inspirational work of lasting importance.Kerouac's classic novel of freedom and longing defined what it meant to be \"Beat\" and has inspired every generation since its initial publication. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86da"
  },
  "title": "Jane Eyre",
  "price": 38.43,
  "availability": 1,
  "description": "Orphaned into the household of her Aunt Reed at Gateshead, subject to the cruel regime at Lowood charity school, Jane Eyre nonetheless emerges unbroken in spirit and integrity. She takes up the post of governess at Thornfield, falls in love with Mr. Rochester, and discovers the impediment to their lawful marriage in a story that transcends melodrama to portray a woman's pa Orphaned into the household of her Aunt Reed at Gateshead, subject to the cruel regime at Lowood charity school, Jane Eyre nonetheless emerges unbroken in spirit and integrity. She takes up the post of governess at Thornfield, falls in love with Mr. Rochester, and discovers the impediment to their lawful marriage in a story that transcends melodrama to portray a woman's passionate search for a wider and richer life than Victorian society traditionally allowed.With a heroine full of yearning, the dangerous secrets she encounters, and the choices she finally makes, Charlotte Bronte's innovative and enduring romantic novel continues to engage and provoke readers. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86db"
  },
  "title": "Frankenstein",
  "price": 38,
  "availability": 1,
  "description": "Mary Shelley began writing Frankenstein when she was only eighteen. At once a Gothic thriller, a passionate romance, and a cautionary tale about the dangers of science, Frankenstein tells the story of committed science student Victor Frankenstein. Obsessed with discovering the cause of generation and life and bestowing animation upon lifeless matter, Frankenstein assembles Mary Shelley began writing Frankenstein when she was only eighteen. At once a Gothic thriller, a passionate romance, and a cautionary tale about the dangers of science, Frankenstein tells the story of committed science student Victor Frankenstein. Obsessed with discovering the cause of generation and life and bestowing animation upon lifeless matter, Frankenstein assembles a human being from stolen body parts but; upon bringing it to life, he recoils in horror at the creature's hideousness. Tormented by isolation and loneliness, the once-innocent creature turns to evil and unleashes a campaign of murderous revenge against his creator, Frankenstein.Frankenstein, an instant bestseller and an important ancestor of both the horror and science fiction genres, not only tells a terrifying story, but also raises profound, disturbing questions about the very nature of life and the place of humankind within the cosmos: What does it mean to be human? What responsibilities do we have to each other? How far can we go in tampering with Nature? In our age, filled with news of organ donation genetic engineering, and bio-terrorism, these questions are more relevant than ever. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86e9"
  },
  "title": "Three Wishes (River of Time: California #1)",
  "price": 44.18,
  "availability": 1,
  "description": "BE CAREFUL WHAT YOU WISH FOR. BECAUSE YOU JUST MIGHT GET IT. Zara Ruiz is a normal California girl on the verge of graduating high school and thinking about her dawning future. But when dusk brings a shattering loss—and she discovers a priceless object in the shallows of a tide pool—she is thrust a hundred-and-eighty years into the past. There she meets handsome ranchero J BE CAREFUL WHAT YOU WISH FOR. BECAUSE YOU JUST MIGHT GET IT. Zara Ruiz is a normal California girl on the verge of graduating high school and thinking about her dawning future. But when dusk brings a shattering loss—and she discovers a priceless object in the shallows of a tide pool—she is thrust a hundred-and-eighty years into the past. There she meets handsome ranchero Javier de la Ventura—who has big dreams and bigger secrets—along with his enchanting family, in a land that is at once familiar, and yet utterly foreign. Between cattle rustlers, pirates and a growing call for statehood, it is not a peaceful time to be a Mexican settler in young Alta California. But it is in that time and place that Zara must decide if she can find what she longs for most in the past, or if her heart's THREE WISHES can only be resolved in the present. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86ea"
  },
  "title": "The Last Girl (The Dominion Trilogy #1)",
  "price": 36.26,
  "availability": 1,
  "description": "A mysterious worldwide epidemic reduces the birthrate of female infants from 50 percent to less than 1 percent. Medical science and governments around the world scramble in an effort to solve the problem, but twenty-five years later there is no cure, and an entire generation grows up with a population of fewer than a thousand women.Zoey and some of the surviving young wome A mysterious worldwide epidemic reduces the birthrate of female infants from 50 percent to less than 1 percent. Medical science and governments around the world scramble in an effort to solve the problem, but twenty-five years later there is no cure, and an entire generation grows up with a population of fewer than a thousand women.Zoey and some of the surviving young women are housed in a scientific research compound dedicated to determining the cause. For two decades, she’s been isolated from her family, treated as a test subject, and locked away—told only that the virus has wiped out the rest of the world’s population.Captivity is the only life Zoey has ever known, and escaping her heavily armed captors is no easy task, but she’s determined to leave before she is subjected to the next round of tests…a program that no other woman has ever returned from. Even if she’s successful, Zoey has no idea what she’ll encounter in the strange new world beyond the facility’s walls. Winning her freedom will take brutality she never imagined she possessed, as well as all her strength and cunning—but Zoey is ready for war. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86eb"
  },
  "title": "Having the Barbarian's Baby (Ice Planet Barbarians #7.5)",
  "price": 34.96,
  "availability": 1,
  "description": "Megan’s ready to give birth, but she’s not ready to let her mate leave her side. When Cashol must go hunting to feed the tribe, they’re separated for the first time since resonance. Not a problem, except the baby’s ready to be born and there’s a storm brewing… This is a short story set in the ICE PLANET BARBARIANS world. It does not stand alone, and is intended to be read Megan’s ready to give birth, but she’s not ready to let her mate leave her side. When Cashol must go hunting to feed the tribe, they’re separated for the first time since resonance. Not a problem, except the baby’s ready to be born and there’s a storm brewing…   This is a short story set in the ICE PLANET BARBARIANS world. It does not stand alone, and is intended to be read after BARBARIAN’S MATE. It’s a little bit of sweetness for those that can’t get enough of the big blue aliens! Happy reading! ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86ef"
  },
  "title": "Settling the Score (The Summer Games #1)",
  "price": 44.91,
  "availability": 1,
  "description": "From the USA TODAY Bestselling author of Scoring Wilder, comes a sexy new standalone novel.As an Olympic rookie, Andie Foster has spent far more time in her cleats than between the sheets. For 21 years, her Friday nights have consisted of blocking shots rather than taking them. But now that she's landed in Rio, she's ready to see for herself if the rumors about the Olympic From the USA TODAY Bestselling author of Scoring Wilder, comes a sexy new standalone novel.As an Olympic rookie, Andie Foster has spent far more time in her cleats than between the sheets. For 21 years, her Friday nights have consisted of blocking shots rather than taking them. But now that she's landed in Rio, she's ready to see for herself if the rumors about the Olympic Village are true:• The athletes are all sex-crazed maniacs... • The committee passes out condoms like candy... • The games continue long after the medals have been handed out... As Andie walks the line between rumor and reality, she's forced into the path of Frederick Archibald, a decorated Olympic swimmer and owner of a sexy British accent--too bad he's unavailable in a way that \"it's complicated\" doesn't even begin to explain.In other words: off limits.It doesn't matter that he has abs that could bring peace to the Middle East and a smile that makes even the Queen blush; Andie fully intends on keeping her focus on the soccer field. But the Village is small. Suffocating. Everywhere Andie goes, Freddie happens to be there--shirtless, wet from the pool, and determined to show her a whole new meaning of the phrase \"international affairs\".Due to strong language and sexual content, this book is not intended for readers under the age of 18. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c86f0"
  },
  "title": "Icing (Aces Hockey #2)",
  "price": 40.44,
  "availability": 1,
  "description": "Hailed by Jami Davenport as her “go-to author for hockey romance,” the bestselling author of the Heller Brothers Hockey series sets the ice ablaze with another sexy novel featuring the gorgeous men of the Chicago Aces.Duncan Armstrong may be an NHL star, but he’s a country boy at heart. His ultimate fantasy is going home with the Stanley Cup, not a gold-digging airhead who Hailed by Jami Davenport as her “go-to author for hockey romance,” the bestselling author of the Heller Brothers Hockey series sets the ice ablaze with another sexy novel featuring the gorgeous men of the Chicago Aces.Duncan Armstrong may be an NHL star, but he’s a country boy at heart. His ultimate fantasy is going home with the Stanley Cup, not a gold-digging airhead who aspires to be a trophy wife and nothing more. Newly single and hoping to enjoy a night out with his teammates, he ends up hitting it off with a down-to-earth waitress who’s a complete breath of fresh air—until Duncan learns that she’s a part-time model. He tries to forget about her, but their sizzling chemistry has him coming back for more.Amber is working hard to put herself through school, and has zero interest in dating a professional athlete. She’s seen firsthand how fame and fortune can mess with their heads—her father’s brilliant football career ended in a firestorm of addiction and infidelity. So Duncan’s attentions immediately have her on the defensive. Still, there’s something different about him. And once she stops trying to freeze him out, irresistible temptation turns into all-consuming passion. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c872e"
  },
  "title": "The Republic",
  "price": 33.78,
  "availability": 1,
  "description": "Presented in the form of a dialogue between Socrates and three different interlocutors, this classic text is an enquiry into the notion of a perfect community and the ideal individual within it. During the conversation, other questions are raised: what is goodness?; what is reality?; and what is knowledge? The Republic also addresses the purpose of education and the role o Presented in the form of a dialogue between Socrates and three different interlocutors, this classic text is an enquiry into the notion of a perfect community and the ideal individual within it. During the conversation, other questions are raised: what is goodness?; what is reality?; and what is knowledge? The Republic also addresses the purpose of education and the role of both women and men as guardians of the people. With remarkable lucidity and deft use of allegory, Plato arrives at a depiction of a state bound by harmony and ruled by philosopher kings. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c872f"
  },
  "title": "The Odyssey",
  "price": 29.64,
  "availability": 1,
  "description": "Literature's grandest evocation of life's journey, at once an ageless human story and an individual test of moral endurance, Homer's ancient Greek epic The Odyssey is translated by Robert Fagles with an introduction and notes by Bernard Knox in Penguin Classics.When Robert Fagles' translation of The Iliad was published in 1990, critics and scholars alike hailed it as a mas Literature's grandest evocation of life's journey, at once an ageless human story and an individual test of moral endurance, Homer's ancient Greek epic The Odyssey is translated by Robert Fagles with an introduction and notes by Bernard Knox in Penguin Classics.When Robert Fagles' translation of The Iliad was published in 1990, critics and scholars alike hailed it as a masterpiece. Here, one of the great modern translators presents us with The Odyssey, Homer's best-loved poem, recounting Odysseus' wanderings after the Trojan War. With wit and wile, the 'man of twists and turns' meets the challenges of the sea-god Poseidon, and monsters ranging from the many-headed Scylla to the cannibalistic Cyclops Polyphemus - only to return after twenty years to a home besieged by his wife Penelope's suitors. In the myths and legends retold in this immortal poem, Fagles has captured the energy of Homer's original in a bold, contemporary idiom.Seven greek cities claim the honour of being the birthplace of Homer (c. 8th-7th century BC), the poet to whom the composition of the Iliad and Odyssey are attributed. The Iliad is the oldest surviving work of Western literature, but the identity - or even the existence - of Homer himself is a complete mystery, with no reliable biographical information having survived.If you enjoyed The Odyssey, you might like Robert Fagles' translation of The Iliad, also available in Penguin Classics.'Wonderfully readable ... Just the right blend of roughness and sophistication'Ted Hughes'A memorable achievement ... Mr Fagles has been remarkably successful in finding a style that is of our time and yet timeless'Richard Jenkyns, The New York Times Book Review'His translation of The Odyssey is his best work yet'Garry Wills, New Yorker ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8730"
  },
  "title": "The Light of the Fireflies",
  "price": 54.43,
  "availability": 1,
  "description": "A haunting and hopeful tale of discovering light in even the darkest of places.For his whole life, the boy has lived underground, in a basement with his parents, grandmother, sister, and brother. Before he was born, his family was disfigured by a fire. His sister wears a white mask to cover her burns.He spends his hours with his cactus, reading his book on insects, or touc A haunting and hopeful tale of discovering light in even the darkest of places.For his whole life, the boy has lived underground, in a basement with his parents, grandmother, sister, and brother. Before he was born, his family was disfigured by a fire. His sister wears a white mask to cover her burns.He spends his hours with his cactus, reading his book on insects, or touching the one ray of sunlight that filters in through a crack in the ceiling. Ever since his sister had a baby, everyone’s been acting very strangely. The boy begins to wonder why they never say who the father is, about what happened before his own birth, about why they’re shut away.A few days ago, some fireflies arrived in the basement. His grandma said, There’s no creature more amazing than one that can make its own light. That light makes the boy want to escape, to know the outside world. Problem is, all the doors are locked. And he doesn’t know how to get out.… ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8731"
  },
  "title": "The Iliad",
  "price": 16.16,
  "availability": 1,
  "description": "The Iliad is one of the two great epics of Homer, and is typically described as one of the greatest war stories of all time, but to say the Iliad is a war story does not begin to describe the emotional sweep of its action and characters: Achilles, Helen, Hector, and other heroes of Greek myth and history in the tenth and final year of the Greek siege of Troy."
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8732"
  },
  "title": "The Communist Manifesto",
  "price": 14.76,
  "availability": 1,
  "description": "A rousing call to arms whose influence is still felt today, Karl Marx and Friedrich Engels' The Communist Manifesto is edited with an introduction by Gareth Stedman-Jones in Penguin Classics.Marx and Engels's revolutionary summons to the working classes, The Communist Manifesto is one of the most important political theories ever formulated. After four years of collaborati A rousing call to arms whose influence is still felt today, Karl Marx and Friedrich Engels' The Communist Manifesto is edited with an introduction by Gareth Stedman-Jones in Penguin Classics.Marx and Engels's revolutionary summons to the working classes, The Communist Manifesto is one of the most important political theories ever formulated. After four years of collaboration, they produced an incisive account of their idea of Communism, in which they envisage a society without classes, private property or a state, arguing that the exploitation of industrial workers will eventually lead to a revolution in which Capitalism is overthrown. This vision provided the theoretical basis of political systems in Russia, China, Cuba and Eastern Europe, affecting the lives of millions. The Communist Manifesto still remains a landmark text: a work that continues to influence and provoke debate on capitalism and class.Gareth Stedman Jones's extensive and scholarly introduction provides an unique assessment of the place of The Communist Manifesto in history, and its continuing relevance as a depiction of global capitalism. This edition reproduces Samuel Moore's translation of 1888 and contains a guide to further reading, notes and an index.Karl Marx (1818-1883) was born in Trier, Germany and studied law at Bonn and Berlin. He settled in London, where he studied economics and wrote the first volume of his major work, Das Kapital (1867, with two further volumes in 1884 and 1894). He is buried in Highgate Cemetery, London.Friedrich Engels (1820-1895), as well as his collaboration with Marx, was the author of The Condition of the Working Class in England (1845), based on personal observations and research.If you enjoyed The Communist Manifesto, you might like Marx's Capital, also available in Penguin Classics.'The words of the Communist Manifesto flare like the fiery writing on the wall above the crumbling bastions of capitalist society: socialism or barbarism!'Rosa Luxemburg ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8733"
  },
  "title": "Lord of the Flies",
  "price": 24.89,
  "availability": 1,
  "description": "Since it was first published in 1954, William Golding's classic debut novel has remained a stark allegory of civilization, survival, and human nature. As dystopian stories like Hunger Games and Battle Royale surge in popularity, this haunting tale of a group of young boys stranded on a desert island still captivates schoolchildren around the world, raising timeless and pro Since it was first published in 1954, William Golding's classic debut novel has remained a stark allegory of civilization, survival, and human nature. As dystopian stories like Hunger Games and Battle Royale surge in popularity, this haunting tale of a group of young boys stranded on a desert island still captivates schoolchildren around the world, raising timeless and profound questions about how easily society can slip into chaos and savagery when rules and order have been abandoned.When a plane crashes on a remote island, a small group of schoolboys are the sole survivors. From the prophetic Simon and virtuous Ralph to the lovable Piggy and brutish Jack, each of the boys attempts to establish control as the reality- and brutal savagery-of their situation sets in.A teacher himself, Golding clearly understood how to interest children with a gripping story and strong, sympathetic characters. The novel serves as a catalyst for thought-provoking discussion and analysis of universal issues, not only concerning the capabilities of humans for good and evil and the fragility of moral inhibition, but beyond.The boys' struggle to find a way of existing in a community with no fixed boundaries invites readers to evaluate the concepts involved in social and political constructs and moral frameworks. Symbolism is strong throughout, revealing both the boys' capacity for empathy and hope, as well as illuminating the darkest corners of the human spirit. Ideas of community, leadership, and the rule of law are called into question as the reader has to consider who has a right to power, why, and what the consequences of the acquisition of power may be.Often compared to Catcher in the Rye, Lord of the Flies also represents a coming-of-age story of innocence lost. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c875c"
  },
  "title": "Vampire Girl (Vampire Girl #1)",
  "price": 53.82,
  "availability": 1,
  "description": "You think it's safe to walk alone at night. It's not. You think the only threat is other humans. It's not. Monsters are real. Demons are real. Vampires are real. And I'm about to become one of them. My name is Arianna Spero. I was an ordinary girl, living an ordinary life, until my mother lapsed into a coma. Now, I am her only hope. She made a deal with the devil, and on m You think it's safe to walk alone at night. It's not. You think the only threat is other humans. It's not. Monsters are real. Demons are real. Vampires are real. And I'm about to become one of them. My name is Arianna Spero. I was an ordinary girl, living an ordinary life, until my mother lapsed into a coma. Now, I am her only hope. She made a deal with the devil, and on my 18th birthday he came to collect. But there's a way to save her. There's something the princes of hell want more than my mother. Me. So I signed my soul away and promised to pick a prince to marry. I would take the blood oath, become one of them, and give them an heir. I would become a princess of hell, and my mother would live. I expected fire and brimstone. I expected pain and misery. I didn't expect beauty. I didn't expect magic. I didn't expect love. But the princes are keeping secrets from me. Secrets that could shatter everything. Scroll up and click the buy button now to uncover the truth... ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c875d"
  },
  "title": "The Silent Twin (Detective Jennifer Knight #3)",
  "price": 36.25,
  "availability": 1,
  "description": "I’m alone in the dark, please can you find me …Nine-year-old twins Abigail and Olivia vow never to be parted. But when Abigail goes missing from Blackwater Farm, DC Jennifer Knight must find her before it’s too late. Twin sister Olivia has been mute since Abigail’s disappearance. But when she whispers in Jennifer’s ear, Jennifer realises it is Abigail’s voice pleading to b I’m alone in the dark, please can you find me …Nine-year-old twins Abigail and Olivia vow never to be parted. But when Abigail goes missing from Blackwater Farm, DC Jennifer Knight must find her before it’s too late. Twin sister Olivia has been mute since Abigail’s disappearance. But when she whispers in Jennifer’s ear, Jennifer realises it is Abigail’s voice pleading to be found. A damp and decaying house set in acres of desolate scrubland, the farm is a place of secrets, old and new – and Jennifer must unravel them all in order to find the lost girl. But could Olivia’s bond with her twin hold the key to finding Abigail? And can Jennifer break through her silence in time to save her sister’s life? A darkly gripping, page-turning thriller that will enthrall fans of Rachel Abbott, Alex Marwood’s The Wicked Girls and Mark Edwards. Praise for Caroline Mitchell:‘Fan-bloody-tastic! I enjoyed this book so much that I forced myself to read slowly as I just could not bear for it to end… I thought the story was brilliant. The characters were creative and kept me hooked. ‘The twists and turns kept me gasping for more… Could not recommend this book any more highly!’ Crime Book Junkie ‘This is a well written supernatural detective story, with a surprising twist that I guarantee will keep you glued to the last page… at times I couldn’t turn the pages quickly enough, it’s atmospheric, gritty and at times just plain scary, and what a twist at the end.’ The Book Review Café ‘With a brilliant cast of crime characters, and a plot that was enough to make me feel dizzy, this was a compelling book that I just couldn't get enough of. Every word, every page, every murder, every guess... I couldn't wait for the final piece of the jigsaw to fit into place… the word 'thrilling' just doesn't do this justice.’ Becca’s Books ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c875e"
  },
  "title": "The Mirror & the Maze (The Wrath and the Dawn #1.5)",
  "price": 29.38,
  "availability": 1,
  "description": "The city of Rey is burning. With smoke billowing, fires blazing and his people fleeing, Khalid races back to defend his city, and protect his queen. But Khalid is too late to do either. He and his men arrive to find the city in ruins, nothing but a maze of destruction, and Shahrzad is gone. But who could have wrought such devastation? Khalid fears he may already know the a The city of Rey is burning. With smoke billowing, fires blazing and his people fleeing, Khalid races back to defend his city, and protect his queen. But Khalid is too late to do either. He and his men arrive to find the city in ruins, nothing but a maze of destruction, and Shahrzad is gone. But who could have wrought such devastation? Khalid fears he may already know the answer, the price of choosing love over the people of Rey all too evident. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c875f"
  },
  "title": "Sister Sable (The Mad Queen #1)",
  "price": 13.33,
  "availability": 1,
  "description": "THE FIRST TENET OF THE WIND: Do not get caught.Sister Sable has lived by the first tenet for seven years, but when an unexpected accident reveals the runaway nun to the clergy, she is forced to embrace the remaining four.THE SECOND TENET OF THE WIND: Win by any means.With the King’s spymaster committed to killing her, and his general regretting he didn’t, Sable enters a de THE FIRST TENET OF THE WIND: Do not get caught.Sister Sable has lived by the first tenet for seven years, but when an unexpected accident reveals the runaway nun to the clergy, she is forced to embrace the remaining four.THE SECOND TENET OF THE WIND: Win by any means.With the King’s spymaster committed to killing her, and his general regretting he didn’t, Sable enters a deadly game.THE THIRD TENET OF THE WIND: The purpose of picking up a blade is to cut the enemy.Scaring them is discretionary.THE FOURTH TENET OF THE WIND: Have no preferred weapon. Even so, she likes the axe.THE FIFTH TENET OF THE WIND: Know the way of all professions.Prophet, pilot, assassin, spy, Sable will need to call upon all she has learned to protect the King’s future from the past. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8760"
  },
  "title": "Shadow Rites (Jane Yellowrock #10)",
  "price": 21.72,
  "availability": 1,
  "description": "Slaying vampires is child’s play for skinwalker Jane Yellowrock. But handling the complicated politics of New Orleans’ supernatural players is another story...Jane is keeping the peace between visiting groups of witches and vamps in the city, but then trouble comes knocking on her doorstep. When her house is magically attacked, the wild chase to find her assailants unearth Slaying vampires is child’s play for skinwalker Jane Yellowrock. But handling the complicated politics of New Orleans’ supernatural players is another story...Jane is keeping the peace between visiting groups of witches and vamps in the city, but then trouble comes knocking on her doorstep. When her house is magically attacked, the wild chase to find her assailants unearths a mystery that has literally been buried deep.A missing master vampire, presumed long deceased, is found chained in a pit...undead, raving mad, and in the company of two human bodies. Now it’s up to Jane to find out who kept the vampire hidden for so long and why, because the incident could tip already high supernatural tensions to an all-out arcane war. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8761"
  },
  "title": "Origins (Alphas 0.5)",
  "price": 28.99,
  "availability": 1,
  "description": "From Ilona Andrews—#1 New York Times bestselling author of Magic Shifts and the Kate Daniels novels—comes a stark, seductive tale of a world torn asunder by supernatural gifts and irresistible passions...Karina Tucker is driving a van of children home from a field trip when an unplanned detour to a seemingly ordinary rest stop changes her life. There, she witnesses a world From Ilona Andrews—#1 New York Times bestselling author of Magic Shifts and the Kate Daniels novels—comes a stark, seductive tale of a world torn asunder by supernatural gifts and irresistible passions...Karina Tucker is driving a van of children home from a field trip when an unplanned detour to a seemingly ordinary rest stop changes her life. There, she witnesses a world beyond humanity’s sight, of frightful powers and chaos, where she is in death’s grip... before an irresistibly dangerous male saves her—only to take her captive.For she is a rare commodity in the shadowy realm she’s entered.Karina soon finds herself caught in a violent civil war where those with inhuman powers strive to destroy each other without mercy. And it becomes all too clear that she must make a choice: submit and become a pawn, or take hold of her own destiny and fight for survival against impossible odds.Alphas: Origins originally appeared in Angels of Darkness. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8762"
  },
  "title": "One Second (Seven #7)",
  "price": 52.94,
  "availability": 1,
  "description": "***USA TODAY BESTSELLING SERIES*** EXPLOSIVE FINAL INSTALLMENT IN THE SEVEN SERIES Book 1 is on sale for a limited time! Love. Family. Brotherhood. Lexi has faced personal struggles, but nothing has prepared her for the most perilous battle of her life. Shifters are on the brink of war as Northerners target Colorado in an attempt to infiltrate the borders. Texas winds up o ***USA TODAY BESTSELLING SERIES*** EXPLOSIVE FINAL INSTALLMENT IN THE SEVEN SERIES Book 1 is on sale for a limited time! Love. Family. Brotherhood. Lexi has faced personal struggles, but nothing has prepared her for the most perilous battle of her life. Shifters are on the brink of war as Northerners target Colorado in an attempt to infiltrate the borders. Texas winds up on the hit list, and the Weston pack prepares to fight for their land… and for their lives. Austin’s courage is put to the test when rogues want to seize his land and slaughter his pack. But that’s not all he’s facing as two shocking revelations turn their lives upside down. His love for Lexi is unwavering, but their future is uncertain. Will the local packs set aside their differences to fight together, or will this be the end of peace among Shifters? Stand witness to the epic conclusion of the Seven series. Destiny will find you. + Cliffhanger-free + HEA SEVEN SERIES READING ORDER: Book 1 - Seven Years (Seven Series #1) Book 2 - Six Months (Seven Series #2) Book 3 - Five Weeks (Seven Series #3) Book 4 - Four Days (Seven Series #4) Book 5 - Three Hours (Seven Series #5) Book 6 - Two Minutes (Seven Series #6) Book 7 - One Second (Seven Series #7) SEVEN WORLD Charming MAGERI SERIES READING ORDER: Book 1 - Sterling (Mageri Series: Book 1) Book 2 - Twist (Mageri Series: Book 2) Book 3 - Impulse (Mageri Series: Book 3) Book 4 - Gravity (Mageri Series: Book 4) Book 5 - Shine (Mageri Series: Book 5) Final Installment! MAGERI WORLD: Risk (coming soon) OTHER BOOKS: Closer: A Novella ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8763"
  },
  "title": "Myriad (Prentor #1)",
  "price": 58.75,
  "availability": 1,
  "description": "Alternate Cover Edition: 14783849642016 Revised EditionKalin, tired of being put down for who he is, leaves home when he turns eighteen. Despite being a warlock, he’s denied his magic for years because his parents told him magic is evil. He just wants to start a new life and leave his past behind.But then Kalin is approached by a group who tell him he has a rare kind of po Alternate Cover Edition: 14783849642016 Revised EditionKalin, tired of being put down for who he is, leaves home when he turns eighteen. Despite being a warlock, he’s denied his magic for years because his parents told him magic is evil. He just wants to start a new life and leave his past behind.But then Kalin is approached by a group who tell him he has a rare kind of power—and the ability to stop a dark warlock from threatening the Royal family. Kalin doesn’t think he can help until one of the witches, a seer named Regina, has a vision about his future. The truth behind his ability shocks him—and may lead to his death and the death of his new friends. With Regina's visions as his guide, will he decide the risk is worth taking?This is a NOVELLA of approximately 27,000 words. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8767"
  },
  "title": "The Hook Up (Game On #1)",
  "price": 36.29,
  "availability": 1,
  "description": "The rules: no kissing on the mouth, no staying the night, no telling anyone, and above all… No falling in love.Anna Jones just wants to finish college and figure out her life. Falling for star quarterback Drew Baylor is certainly not on her to do list. Confident and charming, he lives in the limelight and is way too gorgeous for his own good. If only she could ignore his h The rules: no kissing on the mouth, no staying the night, no telling anyone, and above all… No falling in love.Anna Jones just wants to finish college and figure out her life. Falling for star quarterback Drew Baylor is certainly not on her to do list. Confident and charming, he lives in the limelight and is way too gorgeous for his own good. If only she could ignore his heated stares and stop thinking about doing hot and dirty things with him. Easy right?Too bad he’s committed to making her break every rule…Football has been good to Drew. It’s given him recognition, two National Championships, and the Heisman. But what he really craves is sexy yet prickly Anna Jones. Her cutting humor and blatant disregard for his fame turns him on like nothing else. But there’s one problem: she's shut him down. Completely.That is until a chance encounter leads to the hottest sex of their lives, along with the possibility of something great. Unfortunately, Anna wants it to remain a hook up. Now it’s up to Drew to tempt her with more: more sex, more satisfaction, more time with him. Until she’s truly hooked. It's a good thing Drew knows all about winning.All’s fair in love and football…Game on. New Adult/Contemporary Romance with a HEA - Recommended for readers 17 and older. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8768"
  },
  "title": "Shameless",
  "price": 58.35,
  "availability": 1,
  "description": "***USA TODAY BESTSELLER***Brady…What the hell do I know about raising a baby? Nothing. Not a goddamn thing. Yet here I am, the sole guardian of my niece. I’d be lost if it weren’t for Katherine, the beautiful girl who seems to have all the answers. Katherine, who’s slowly finding her way into my cynical heart. I keep reminding myself that I can’t fall for someone when we d ***USA TODAY BESTSELLER***Brady…What the hell do I know about raising a baby? Nothing. Not a goddamn thing. Yet here I am, the sole guardian of my niece. I’d be lost if it weren’t for Katherine, the beautiful girl who seems to have all the answers. Katherine, who’s slowly finding her way into my cynical heart. I keep reminding myself that I can’t fall for someone when we don’t have a future. But telling myself this lie and believing it are two different things. Katherine…When Brady shows up on a Harley, looking like an avenging angel—six feet, three inches of chiseled muscle, eyes the color of wild sage, and sun-kissed skin emblazoned with tattoos—I’m not sure if I should fall at his feet or run like hell. Because if I tell him what happened the night his family died, he might hate me. What I don’t count on are the nights we spend together trying to forget the heartache that brought us here. I promise him it won’t mean anything, that I won’t fall in love. I shouldn’t make promises I can’t keep.* Author's note: Due to mature situations and sexual content, Shameless is recommended for readers 18+. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c8769"
  },
  "title": "Off Sides (Off #1)",
  "price": 39.45,
  "availability": 1,
  "description": "“I'm not sure what possessed me to do it. Maybe it was the impossible expectations I faced, maybe it was my own self-loathing. But I just knew I needed something different to happen. I needed someone... something... to derail me from my current path. Otherwise, I would become lost... a hollowed out shell of a man. So I did it. I approached her, then I pursued her, then I m “I'm not sure what possessed me to do it. Maybe it was the impossible expectations I faced, maybe it was my own self-loathing. But I just knew I needed something different to happen. I needed someone... something... to derail me from my current path. Otherwise, I would become lost... a hollowed out shell of a man. So I did it. I approached her, then I pursued her, then I made her mine. And my life was saved...”Ryan Burnham is the privileged son of a U.S. Congressman and captain of his university’s hockey team. While he is on the verge of fulfilling his dreams to play in the NHL, his parents want him on a different course. One he is expected to accept for the sake of his family’s public image.Forced her to abandon her music career after the heart breaking death of her parents, Danny Cross exists on the opposite side of the tracks from Ryan. She is struggling to make her own way, working two jobs, attending college part time and volunteering in a homeless shelter. She is on a mission to build her own success.With a chance meeting, their vastly different worlds collide, causing each to evaluate whether they are truly on the correct path to self-fulfillment and happiness. Can their relationship survive? Particularly when others are against them every step of the way. A lot can happen in just ten short days... ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c879e"
  },
  "title": "The Haters",
  "price": 27.89,
  "availability": 1,
  "description": "From Jesse Andrews, author of the New York Times bestselling Me and Earl and the Dying Girl and screenwriter of the Sundance award–winning motion picture of the same name, comes a groundbreaking young adult novel about music, love, friendship, and freedom as three young musicians follow a quest to escape the law long enough to play the amazing show they hope (but also doub From Jesse Andrews, author of the New York Times bestselling Me and Earl and the Dying Girl and screenwriter of the Sundance award–winning motion picture of the same name, comes a groundbreaking young adult novel about music, love, friendship, and freedom as three young musicians follow a quest to escape the law long enough to play the amazing show they hope (but also doubt) they have in them.Inspired by the years he spent playing bass in a band himself, The Haters is Jesse Andrews’s road trip adventure about a trio of jazz-camp escapees who, against every realistic expectation, become a band. For Wes and his best friend, Corey, jazz camp turns out to be lame. It’s pretty much all dudes talking in Jazz Voice. But then they jam with Ash, a charismatic girl with an unusual sound, and the three just click. It’s three and a half hours of pure musical magic, and Ash makes a decision: They need to hit the road. Because the road, not summer camp, is where bands get good. Before Wes and Corey know it, they’re in Ash’s SUV heading south, and The Haters Summer of Hate Tour has begun.In his second novel, Andrews again brings his brilliant and distinctive voice to YA, in the perfect book for music lovers, fans of The Commitments and High Fidelity, or anyone who has ever loved—and hated—a song or a band. This witty, funny coming-of-age novel is contemporary fiction at its best. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c879f"
  },
  "title": "The Art of Not Breathing",
  "price": 40.83,
  "availability": 1,
  "description": "Since her twin brother, Eddie, drowned five years ago, sixteen-year-old Elsie Main has tried to remember what really happened that fateful day on the beach. One minute Eddie was there, and the next he was gone. Seventeen-year-old Tay McKenzie is a cute and mysterious boy that Elsie meets in her favorite boathouse hangout. When Tay introduces Elsie to the world of freedivin Since her twin brother, Eddie, drowned five years ago, sixteen-year-old Elsie Main has tried to remember what really happened that fateful day on the beach. One minute Eddie was there, and the next he was gone. Seventeen-year-old Tay McKenzie is a cute and mysterious boy that Elsie meets in her favorite boathouse hangout. When Tay introduces Elsie to the world of freediving, she vows to find the answers she seeks at the bottom of the sea. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c87ad"
  },
  "title": "The Selfish Gene",
  "price": 29.45,
  "availability": 1,
  "description": "Richard Dawkins' brilliant reformulation of the theory of natural selection has the rare distinction of having provoked as much excitement and interest outside the scientific community as within it. His theories have helped change the whole nature of the study of social biology, and have forced thousands of readers to rethink their beliefs about life. In his internationall Richard Dawkins' brilliant reformulation of the theory of natural selection has the rare distinction of having provoked as much excitement and interest outside the scientific community as within it. His theories have helped change the whole nature of the study of social biology, and have forced thousands of readers to rethink their beliefs about life. In his internationally bestselling, now classic volume, The Selfish Gene, Dawkins explains how the selfish gene can also be a subtle gene. The world of the selfish gene revolves around savage competition, ruthless exploitation, and deceit, and yet, Dawkins argues, acts of apparent altruism do exist in nature. Bees, for example, will commit suicide when they sting to protect the hive, and birds will risk their lives to warn the flock of an approaching hawk. This 30th anniversary edition of Dawkins' fascinating book retains all original material, including the two enlightening chapters added in the second edition. In a new Introduction the author presents his thoughts thirty years after the publication of his first and most famous book, while the inclusion of the two-page original Foreword by brilliant American scientist Robert Trivers shows the enthusiastic reaction of the scientific community at that time. This edition is a celebration of a remarkable exposition of evolutionary thought, a work that has been widely hailed for its stylistic brilliance and deep scientific insights, and that continues to stimulate whole new areas of research today. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c87c0"
  },
  "title": "Twenty Love Poems and a Song of Despair",
  "price": 30.95,
  "availability": 1,
  "description": "Drawn from the most intimate and personal associations, Pablo Neruda's most beloved collection of poetry juxtaposes the exuberance of youthful passion with the desolation of grief, the sensuality of the body with the metaphorical nuances of nature. Pulitzer Prize-winning poet W. S. Merwin's masterly translation faces the original Spanish text. This edition also features an Drawn from the most intimate and personal associations, Pablo Neruda's most beloved collection of poetry juxtaposes the exuberance of youthful passion with the desolation of grief, the sensuality of the body with the metaphorical nuances of nature. Pulitzer Prize-winning poet W. S. Merwin's masterly translation faces the original Spanish text. This edition also features an insightful Introduction by Cristina Garcia. More than eighty years after its publication, Twenty Love Poems and a Song of Despair stands as an essential collection that continues to inspire lovers and poets around the world. ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c87c1"
  },
  "title": "Vampire Knight, Vol. 1 (Vampire Knight #1)",
  "price": 15.4,
  "availability": 1,
  "description": "Yuki Cross has no memory of her past prior to the moment she was saved from a vampire attack ten years ago. She was adopted by the headmaster of Cross Academy, and now works alongside Zero to guard the Academy's secret. Cross Adademy is attended by two groups of students: the Day Class and the Night Class. At twilight, when the students of the Day Class return to their dor Yuki Cross has no memory of her past prior to the moment she was saved from a vampire attack ten years ago. She was adopted by the headmaster of Cross Academy, and now works alongside Zero to guard the Academy's secret. Cross Adademy is attended by two groups of students: the Day Class and the Night Class. At twilight, when the students of the Day Class return to their dorm, they cross paths with the Night Class on their way to school. Yuki Cross and Zero Kiryu are the Guardians of the school, protecting the Day Class from the Academy's dark secret: the Night Class is full of vampires! ...more"
},
{
  "_id": {
    "$oid": "6762511c9df1004d490c87c9"
  },
  "title": "Ways of Seeing",
  "price": 39.51,
  "availability": 1,
  "description": "John Berger’s Classic Text on ArtJohn Berger's Ways of Seeing is one of the most stimulating and the most influential books on art in any language. First published in 1972, it was based on the BBC television series about which the (London) Sunday Times critic commented: \"This is an eye-opener in more ways than one: by concentrating on how we look at paintings . . . he will John Berger’s Classic Text on ArtJohn Berger's Ways of Seeing is one of the most stimulating and the most influential books on art in any language. First published in 1972, it was based on the BBC television series about which the (London) Sunday Times critic commented: \"This is an eye-opener in more ways than one: by concentrating on how we look at paintings . . . he will almost certainly change the way you look at pictures.\" By now he has.\"Berger has the ability to cut right through the mystification of the professional art critics . . . He is a liberator of images: and once we have allowed the paintings to work on us directly, we are in a much better position to make a meaningful evaluation\" —Peter Fuller, Arts Review\"The influence of the series and the book . . . was enormous . . . It opened up for general attention to areas of cultural study that are now commonplace\" —Geoff Dyer in Ways of TellingWinner of the 1972 Booker Prize for his novel, G., John Peter Berger (born November 5th, 1926) is an art critic, painter and author of many novels including A Painter of Our Time, From A to X and Bento’s Sketchbook. ...more"
}]